#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AbilityActor_KingsGuardlance

#include "Basic.hpp"

#include "M1_classes.hpp"
#include "Engine_structs.hpp"
#include "MAGSpawnedNiagaraComponents_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AbilityActor_KingsGuardlance.AbilityActor_KingsGuardlance_C
// 0x0158 (0x0828 - 0x06D0)
class AAbilityActor_KingsGuardlance_C final : public AM1AbilityActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      Capsule;                                           // 0x06D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        MaxDuration;                                       // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Duration;                                          // 0x06F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IncreaseDuration;                                  // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DamageRadius;                                      // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IncreaseDamageRadius;                              // 0x0708(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DamageCooltime;                                    // 0x0710(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           WaitDamageCooltimeTimer;                           // 0x0718(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              AttachedFxs;                                       // 0x0720(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class AActor*, struct FMAGSpawnedNiagaraComponents> DamageBeamFxsMap;                                  // 0x0730(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class AActor*, struct FTimerHandle>      DamageBeamEndTimerMap;                             // 0x0780(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class AActor*, double>                   BeamFxsRemainTimeMap;                              // 0x07D0(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	double                                        BeamFxsDefaultRemainTime;                          // 0x0820(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BeamUpdateTick(float DeltaSeconds);
	void BP_OnPostSpawnAbilityActor();
	void ExecuteUbergraph_AbilityActor_KingsGuardlance(int32 EntryPoint);
	void MakeDamageFxParam(struct FM1FXParam* M1FXParam);
	void OnDestroyed_Event(class AActor* DestroyedActor);
	void OnEvent_ECFB179B4E60876B7384E08F67E2AF62(const struct FM1CalcDamageInfo& DamageInfo);
	void OnFinishDamageCooltime();
	void ReceiveDestroyed();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AbilityActor_KingsGuardlance_C">();
	}
	static class AAbilityActor_KingsGuardlance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAbilityActor_KingsGuardlance_C>();
	}
};
static_assert(alignof(AAbilityActor_KingsGuardlance_C) == 0x000008, "Wrong alignment on AAbilityActor_KingsGuardlance_C");
static_assert(sizeof(AAbilityActor_KingsGuardlance_C) == 0x000828, "Wrong size on AAbilityActor_KingsGuardlance_C");
static_assert(offsetof(AAbilityActor_KingsGuardlance_C, UberGraphFrame) == 0x0006D0, "Member 'AAbilityActor_KingsGuardlance_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAbilityActor_KingsGuardlance_C, Capsule) == 0x0006D8, "Member 'AAbilityActor_KingsGuardlance_C::Capsule' has a wrong offset!");
static_assert(offsetof(AAbilityActor_KingsGuardlance_C, StaticMesh) == 0x0006E0, "Member 'AAbilityActor_KingsGuardlance_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AAbilityActor_KingsGuardlance_C, MaxDuration) == 0x0006E8, "Member 'AAbilityActor_KingsGuardlance_C::MaxDuration' has a wrong offset!");
static_assert(offsetof(AAbilityActor_KingsGuardlance_C, Duration) == 0x0006F0, "Member 'AAbilityActor_KingsGuardlance_C::Duration' has a wrong offset!");
static_assert(offsetof(AAbilityActor_KingsGuardlance_C, IncreaseDuration) == 0x0006F8, "Member 'AAbilityActor_KingsGuardlance_C::IncreaseDuration' has a wrong offset!");
static_assert(offsetof(AAbilityActor_KingsGuardlance_C, DamageRadius) == 0x000700, "Member 'AAbilityActor_KingsGuardlance_C::DamageRadius' has a wrong offset!");
static_assert(offsetof(AAbilityActor_KingsGuardlance_C, IncreaseDamageRadius) == 0x000708, "Member 'AAbilityActor_KingsGuardlance_C::IncreaseDamageRadius' has a wrong offset!");
static_assert(offsetof(AAbilityActor_KingsGuardlance_C, DamageCooltime) == 0x000710, "Member 'AAbilityActor_KingsGuardlance_C::DamageCooltime' has a wrong offset!");
static_assert(offsetof(AAbilityActor_KingsGuardlance_C, WaitDamageCooltimeTimer) == 0x000718, "Member 'AAbilityActor_KingsGuardlance_C::WaitDamageCooltimeTimer' has a wrong offset!");
static_assert(offsetof(AAbilityActor_KingsGuardlance_C, AttachedFxs) == 0x000720, "Member 'AAbilityActor_KingsGuardlance_C::AttachedFxs' has a wrong offset!");
static_assert(offsetof(AAbilityActor_KingsGuardlance_C, DamageBeamFxsMap) == 0x000730, "Member 'AAbilityActor_KingsGuardlance_C::DamageBeamFxsMap' has a wrong offset!");
static_assert(offsetof(AAbilityActor_KingsGuardlance_C, DamageBeamEndTimerMap) == 0x000780, "Member 'AAbilityActor_KingsGuardlance_C::DamageBeamEndTimerMap' has a wrong offset!");
static_assert(offsetof(AAbilityActor_KingsGuardlance_C, BeamFxsRemainTimeMap) == 0x0007D0, "Member 'AAbilityActor_KingsGuardlance_C::BeamFxsRemainTimeMap' has a wrong offset!");
static_assert(offsetof(AAbilityActor_KingsGuardlance_C, BeamFxsDefaultRemainTime) == 0x000820, "Member 'AAbilityActor_KingsGuardlance_C::BeamFxsDefaultRemainTime' has a wrong offset!");

}

