#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AbilityActor_KingsGuardlance

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "M1_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "M1Data_structs.hpp"
#include "MAGSpawnedNiagaraComponents_structs.hpp"


namespace SDK::Params
{

// Function AbilityActor_KingsGuardlance.AbilityActor_KingsGuardlance_C.BeamUpdateTick
// 0x0004 (0x0004 - 0x0000)
struct AbilityActor_KingsGuardlance_C_BeamUpdateTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AbilityActor_KingsGuardlance_C_BeamUpdateTick) == 0x000004, "Wrong alignment on AbilityActor_KingsGuardlance_C_BeamUpdateTick");
static_assert(sizeof(AbilityActor_KingsGuardlance_C_BeamUpdateTick) == 0x000004, "Wrong size on AbilityActor_KingsGuardlance_C_BeamUpdateTick");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_BeamUpdateTick, DeltaSeconds) == 0x000000, "Member 'AbilityActor_KingsGuardlance_C_BeamUpdateTick::DeltaSeconds' has a wrong offset!");

// Function AbilityActor_KingsGuardlance.AbilityActor_KingsGuardlance_C.ExecuteUbergraph_AbilityActor_KingsGuardlance
// 0x08D0 (0x08D0 - 0x0000)
struct AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLifeSpan_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FM1CalcDamageInfo& DamageInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1CalcDamageInfo                      K2Node_CustomEvent_DamageInfo;                     // 0x0020(0x0138)(ConstParm, ContainsInstancedReference)
	struct FM1CalcDamageInfo                      Temp_struct_Variable;                              // 0x0158(0x0138)(ContainsInstancedReference)
	class UM1AbilityAsync_WaitDamageEvent*        CallFunc_WaitGetDamageEventToActor_ReturnValue;    // 0x0290(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29A[0x6];                                      // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue;       // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AbilityParamData                    K2Node_MakeStruct_M1AbilityParamData;              // 0x02B8(0x0020)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FM1AbilityParamData>            K2Node_MakeArray_Array;                            // 0x02E0(0x0010)(ReferenceParm)
	struct FM1AbilityOperationParam               K2Node_MakeStruct_M1AbilityOperationParam;         // 0x02F0(0x00B0)(ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x03A8(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x03BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UM1TickableDelegateSubsystem*           CallFunc_GetWorldSubsystem_ReturnValue;            // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x03F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC[0x4];                                      // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0400(0x0030)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FM1FXParam                             CallFunc_MakeDamageFxParam_M1FXParam;              // 0x0430(0x0030)()
	TArray<class UNiagaraComponent*>              CallFunc_SpawnFXsForAbility_ReturnValue;           // 0x0460(0x0010)(ReferenceParm, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetAbilityInstigator_ReturnValue;         // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAbilityInstigator_ReturnValue_1;       // 0x0478(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_FindActorsInRadius_OutActors;             // 0x0488(0x0010)(ReferenceParm)
	bool                                          CallFunc_FindActorsInRadius_ReturnValue;           // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49A[0x2];                                      // 0x049A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x04A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A5[0x3];                                      // 0x04A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x04AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AD[0x3];                                      // 0x04AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAbilityInstigator_ReturnValue_2;       // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FM1FXParam                             CallFunc_MakeDamageFxParam_M1FXParam_1;            // 0x04B8(0x0030)()
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue;                 // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNiagaraComponent*>              CallFunc_SpawnFXsForAbility_ReturnValue_1;         // 0x04F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0501(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_502[0x6];                                      // 0x0502(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNiagaraComponent*>              CallFunc_SpawnFXsForAbility_ReturnValue_2;         // 0x0508(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_519[0x7];                                      // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0520(0x0030)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FM1FXParam                             CallFunc_MakeDamageFxParam_M1FXParam_2;            // 0x0550(0x0030)()
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0580(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0588(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58C[0x4];                                      // 0x058C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAbilityInstigator_ReturnValue_3;       // 0x0590(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UM1TickableDelegateSubsystem*           CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0598(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ENetRole                                      CallFunc_GetLocalRole_ReturnValue_1;               // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A1[0x7];                                      // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1FXParam                             CallFunc_MakeDamageFxParam_M1FXParam_3;            // 0x05A8(0x0030)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x05D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DA[0x6];                                      // 0x05DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue_2;               // 0x05E0(0x0030)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_611[0x7];                                      // 0x0611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNiagaraComponent*>              CallFunc_SpawnFXsForAbility_ReturnValue_3;         // 0x0618(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              CallFunc_SpawnFXsForAbility_ReturnValue_4;         // 0x0628(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x063C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63D[0x3];                                      // 0x063D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_644[0x4];                                      // 0x0644(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_Map_Keys_Keys;                            // 0x0648(0x0010)(ReferenceParm)
	float                                         K2Node_CustomEvent_DeltaSeconds;                   // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65C[0x4];                                      // 0x065C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0660(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0668(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x066C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0678(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_679[0x3];                                      // 0x0679(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1FXVectorParam                       K2Node_MakeStruct_M1FXVectorParam;                 // 0x067C(0x0014)(NoDestructor)
	TArray<struct FM1FXVectorParam>               K2Node_MakeArray_Array_1;                          // 0x0690(0x0010)(ReferenceParm)
	struct FMAGSpawnedNiagaraComponents           CallFunc_Map_Find_Value;                           // 0x06A0(0x0010)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B1[0x7];                                      // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1FXParam                             K2Node_MakeStruct_M1FXParam;                       // 0x06B8(0x0030)()
	class UNiagaraComponent*                      CallFunc_Array_Get_Item_2;                         // 0x06E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x06F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F5[0x3];                                      // 0x06F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float DeltaSeconds)>           K2Node_CreateDelegate_OutputDelegate_2;            // 0x06F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0708(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x070C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70D[0x3];                                      // 0x070D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_Map_Keys_Keys_1;                          // 0x0710(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_3;                         // 0x0720(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x072C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x072D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue_1;                 // 0x072E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72F[0x1];                                      // 0x072F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value_1;                         // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_739[0x7];                                      // 0x0739(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_751[0x3];                                      // 0x0751(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Length_ReturnValue_1;                 // 0x0754(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_759[0x3];                                      // 0x0759(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float DeltaSeconds)>           K2Node_CreateDelegate_OutputDelegate_3;            // 0x075C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x076C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_4;                         // 0x0770(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Contains_ReturnValue;                 // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_779[0x3];                                      // 0x0779(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x077C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FM1FXVectorParam                       K2Node_MakeStruct_M1FXVectorParam_1;               // 0x0788(0x0014)(NoDestructor)
	uint8                                         Pad_79C[0x4];                                      // 0x079C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x07A0(0x0030)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FM1FXVectorParam>               K2Node_MakeArray_Array_2;                          // 0x07D0(0x0010)(ReferenceParm)
	TArray<class UNiagaraComponent*>              CallFunc_SpawnFXsForAbility_ReturnValue_5;         // 0x07E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FM1FXParam                             K2Node_MakeStruct_M1FXParam_1;                     // 0x07F0(0x0030)()
	TArray<class UNiagaraComponent*>              CallFunc_SpawnFXsForAbilityToTarget_ReturnValue;   // 0x0820(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FMAGSpawnedNiagaraComponents           K2Node_MakeStruct_MAGSpawnedNiagaraComponents;     // 0x0830(0x0010)(ContainsInstancedReference, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0840(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue_2;                 // 0x0848(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue_3;                 // 0x0849(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84A[0x6];                                      // 0x084A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0850(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0858(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0860(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0870(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0878(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLifeSpan_ReturnValue_1;                // 0x0880(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0884(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_885[0x3];                                      // 0x0885(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0888(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0890(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_891[0x7];                                      // 0x0891(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetLifeSpan_InLifespan_ImplicitCast;      // 0x08A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FindActorsInRadius_InRadius_ImplicitCast; // 0x08A4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x08A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8AC[0x4];                                      // 0x08AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x08B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x08B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetLifeSpan_InLifespan_ImplicitCast_1;    // 0x08C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance) == 0x000010, "Wrong alignment on AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance");
static_assert(sizeof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance) == 0x0008D0, "Wrong size on AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, EntryPoint) == 0x000000, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::EntryPoint' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_GetLifeSpan_ReturnValue) == 0x000004, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_GetLifeSpan_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000008, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, K2Node_CustomEvent_DamageInfo) == 0x000020, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::K2Node_CustomEvent_DamageInfo' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, Temp_struct_Variable) == 0x000158, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_WaitGetDamageEventToActor_ReturnValue) == 0x000290, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_WaitGetDamageEventToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_IsValid_ReturnValue) == 0x000298, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_HasTag_ReturnValue) == 0x000299, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Conv_ScaledIntToString_ReturnValue) == 0x0002A0, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Conv_ScaledIntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, Temp_int_Loop_Counter_Variable) == 0x0002B0, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, K2Node_MakeStruct_M1AbilityParamData) == 0x0002B8, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::K2Node_MakeStruct_M1AbilityParamData' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Add_IntInt_ReturnValue) == 0x0002D8, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, K2Node_MakeArray_Array) == 0x0002E0, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, K2Node_MakeStruct_M1AbilityOperationParam) == 0x0002F0, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::K2Node_MakeStruct_M1AbilityOperationParam' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, Temp_int_Array_Index_Variable) == 0x0003A0, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_IsDedicatedServer_ReturnValue) == 0x0003A4, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, Temp_struct_Variable_1) == 0x0003A8, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, Temp_int_Loop_Counter_Variable_1) == 0x0003B0, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Add_IntInt_ReturnValue_1) == 0x0003B4, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, Temp_int_Array_Index_Variable_1) == 0x0003B8, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, K2Node_CreateDelegate_OutputDelegate_1) == 0x0003BC, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, Temp_int_Array_Index_Variable_2) == 0x0003CC, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, Temp_int_Loop_Counter_Variable_2) == 0x0003D0, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Add_IntInt_ReturnValue_2) == 0x0003D4, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, Temp_int_Array_Index_Variable_3) == 0x0003D8, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_GetWorldSubsystem_ReturnValue) == 0x0003E0, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_GetWorldSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0003E8, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0003F0, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_GetTransform_ReturnValue) == 0x000400, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_MakeDamageFxParam_M1FXParam) == 0x000430, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_MakeDamageFxParam_M1FXParam' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_SpawnFXsForAbility_ReturnValue) == 0x000460, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_SpawnFXsForAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_GetAbilityInstigator_ReturnValue) == 0x000470, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_GetAbilityInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_GetAbilityInstigator_ReturnValue_1) == 0x000478, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_GetAbilityInstigator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000480, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_FindActorsInRadius_OutActors) == 0x000488, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_FindActorsInRadius_OutActors' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_FindActorsInRadius_ReturnValue) == 0x000498, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_FindActorsInRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_BooleanAND_ReturnValue) == 0x000499, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Array_Length_ReturnValue) == 0x00049C, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, Temp_int_Loop_Counter_Variable_3) == 0x0004A0, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Less_IntInt_ReturnValue) == 0x0004A4, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Add_IntInt_ReturnValue_3) == 0x0004A8, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x0004AC, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_GetAbilityInstigator_ReturnValue_2) == 0x0004B0, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_GetAbilityInstigator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_MakeDamageFxParam_M1FXParam_1) == 0x0004B8, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_MakeDamageFxParam_M1FXParam_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_GetLocalRole_ReturnValue) == 0x0004E8, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_GetLocalRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_SpawnFXsForAbility_ReturnValue_1) == 0x0004F0, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_SpawnFXsForAbility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000500, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000501, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_SpawnFXsForAbility_ReturnValue_2) == 0x000508, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_SpawnFXsForAbility_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_BooleanOR_ReturnValue) == 0x000518, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_GetTransform_ReturnValue_1) == 0x000520, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_MakeDamageFxParam_M1FXParam_2) == 0x000550, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_MakeDamageFxParam_M1FXParam_2' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Array_Get_Item) == 0x000580, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Array_Length_ReturnValue_1) == 0x000588, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_GetAbilityInstigator_ReturnValue_3) == 0x000590, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_GetAbilityInstigator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_GetWorldSubsystem_ReturnValue_1) == 0x000598, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_GetWorldSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_GetLocalRole_ReturnValue_1) == 0x0005A0, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_GetLocalRole_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_MakeDamageFxParam_M1FXParam_3) == 0x0005A8, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_MakeDamageFxParam_M1FXParam_3' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0005D8, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x0005D9, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_GetTransform_ReturnValue_2) == 0x0005E0, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_GetTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_BooleanOR_ReturnValue_1) == 0x000610, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_SpawnFXsForAbility_ReturnValue_3) == 0x000618, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_SpawnFXsForAbility_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_SpawnFXsForAbility_ReturnValue_4) == 0x000628, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_SpawnFXsForAbility_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, Temp_int_Loop_Counter_Variable_4) == 0x000638, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Less_IntInt_ReturnValue_1) == 0x00063C, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Add_IntInt_ReturnValue_4) == 0x000640, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Map_Keys_Keys) == 0x000648, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, K2Node_CustomEvent_DeltaSeconds) == 0x000658, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::K2Node_CustomEvent_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Array_Get_Item_1) == 0x000660, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Array_Length_ReturnValue_2) == 0x000668, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00066C, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Less_IntInt_ReturnValue_2) == 0x000678, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, K2Node_MakeStruct_M1FXVectorParam) == 0x00067C, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::K2Node_MakeStruct_M1FXVectorParam' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, K2Node_MakeArray_Array_1) == 0x000690, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Map_Find_Value) == 0x0006A0, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Map_Find_ReturnValue) == 0x0006B0, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, K2Node_MakeStruct_M1FXParam) == 0x0006B8, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::K2Node_MakeStruct_M1FXParam' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Array_Get_Item_2) == 0x0006E8, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Array_Length_ReturnValue_3) == 0x0006F0, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Less_IntInt_ReturnValue_3) == 0x0006F4, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, K2Node_CreateDelegate_OutputDelegate_2) == 0x0006F8, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Map_Length_ReturnValue) == 0x000708, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00070C, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Map_Keys_Keys_1) == 0x000710, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Map_Keys_Keys_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Array_Get_Item_3) == 0x000720, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Array_Length_ReturnValue_4) == 0x000728, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Map_Remove_ReturnValue) == 0x00072C, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Less_IntInt_ReturnValue_4) == 0x00072D, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Map_Remove_ReturnValue_1) == 0x00072E, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Map_Remove_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Map_Find_Value_1) == 0x000730, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Map_Find_ReturnValue_1) == 0x000738, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_SelectFloat_ReturnValue) == 0x000740, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000748, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000750, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Map_Length_ReturnValue_1) == 0x000754, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Map_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000758, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, K2Node_CreateDelegate_OutputDelegate_3) == 0x00075C, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, Temp_int_Array_Index_Variable_4) == 0x00076C, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance, CallFunc_Array_Get_Item_4) == 0x000770, "Member 'AbilityActor_KingsGuardlance_C_ExecuteUbergraph_AbilityActor_KingsGuardlance::CallFunc_Array_Get_Item_4' has a wrong offset!");
