#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_NPC_045_SubQuestManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_NPC_045_SubQuestManager.AnimBP_NPC_045_SubQuestManager_C
// 0x0080 (0x03A0 - 0x0320)
class UAnimBP_NPC_045_SubQuestManager_C final : public UAnimInstance
{
public:
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0328(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0330(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0338(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0358(0x0048)()

public:
	void ExecuteUbergraph_AnimBP_NPC_045_SubQuestManager(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_NPC_045_SubQuestManager_C">();
	}
	static class UAnimBP_NPC_045_SubQuestManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_NPC_045_SubQuestManager_C>();
	}
};
static_assert(alignof(UAnimBP_NPC_045_SubQuestManager_C) == 0x000010, "Wrong alignment on UAnimBP_NPC_045_SubQuestManager_C");
static_assert(sizeof(UAnimBP_NPC_045_SubQuestManager_C) == 0x0003A0, "Wrong size on UAnimBP_NPC_045_SubQuestManager_C");
static_assert(offsetof(UAnimBP_NPC_045_SubQuestManager_C, UberGraphFrame) == 0x000320, "Member 'UAnimBP_NPC_045_SubQuestManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_NPC_045_SubQuestManager_C, AnimBlueprintExtension_PropertyAccess) == 0x000328, "Member 'UAnimBP_NPC_045_SubQuestManager_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UAnimBP_NPC_045_SubQuestManager_C, AnimBlueprintExtension_Base) == 0x000330, "Member 'UAnimBP_NPC_045_SubQuestManager_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UAnimBP_NPC_045_SubQuestManager_C, AnimGraphNode_Root) == 0x000338, "Member 'UAnimBP_NPC_045_SubQuestManager_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAnimBP_NPC_045_SubQuestManager_C, AnimGraphNode_SequencePlayer) == 0x000358, "Member 'UAnimBP_NPC_045_SubQuestManager_C::AnimGraphNode_SequencePlayer' has a wrong offset!");

}

