#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AOE_Blair_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "M1_structs.hpp"
#include "Engine_structs.hpp"
#include "AOEBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AOE_Blair_Base.AOE_Blair_Base_C
// 0x00B0 (0x08E0 - 0x0830)
class AAOE_Blair_Base_C final : public AAOEBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AOE_Blair_Base_C;                   // 0x0830(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      AOE_NS_Blair_Skill01_DecalEnd;                     // 0x0838(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Blair_Skill02_Mana_Proj;                        // 0x0840(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      AOE_NS_Blair_Skill02_Mana_Creat;                   // 0x0848(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ConsumingTimeline_Offset_6CB354CA4F68577D6907A39CDC211FDC; // 0x0850(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ConsumingTimeline_LerpAlpha_6CB354CA4F68577D6907A39CDC211FDC; // 0x085C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ConsumingTimeline__Direction_6CB354CA4F68577D6907A39CDC211FDC; // 0x0860(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_861[0x7];                                      // 0x0861(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ConsumingTimeline;                                 // 0x0868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartConsumingLoc;                                 // 0x0870(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DestConsumingOffset;                               // 0x087C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ConsumingOpTags;                                   // 0x0888(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   ConsumingEndFxTag;                                 // 0x08A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          ProjSpawnAkEvent;                                  // 0x08B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          ProjDestroyAkEvent;                                // 0x08B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UCameraShakeBase>           ConsumingCameraShake;                              // 0x08C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         ConsumingCameraShakeRadius;                        // 0x08C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ConsumingCameraShakeDelay;                         // 0x08CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              LoopFXs;                                           // 0x08D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ActivateConsuming();
	void BP_OnPostSpawnAbilityActor();
	void ConsumingTimeline__FinishedFunc();
	void ConsumingTimeline__UpdateFunc();
	void ExecuteUbergraph_AOE_Blair_Base(int32 EntryPoint);
	void FadeOutLoopFXs();
	void InitializeFxParams();
	void OnConsumingActivated();
	void OnEndOfDuration();
	void PlayProjectileAkEvent(bool bSpawnOrDestroy);
	void ReceiveDestroyed();
	void SpawnLoopFXs();
	void SpawnUniqueEndFx();
	void StartFadeOut();
	void UpdateDestConsumingLoc(double Alpha, const struct FVector& CurveOffset);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AOE_Blair_Base_C">();
	}
	static class AAOE_Blair_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAOE_Blair_Base_C>();
	}
};
static_assert(alignof(AAOE_Blair_Base_C) == 0x000008, "Wrong alignment on AAOE_Blair_Base_C");
static_assert(sizeof(AAOE_Blair_Base_C) == 0x0008E0, "Wrong size on AAOE_Blair_Base_C");
static_assert(offsetof(AAOE_Blair_Base_C, UberGraphFrame_AOE_Blair_Base_C) == 0x000830, "Member 'AAOE_Blair_Base_C::UberGraphFrame_AOE_Blair_Base_C' has a wrong offset!");
static_assert(offsetof(AAOE_Blair_Base_C, AOE_NS_Blair_Skill01_DecalEnd) == 0x000838, "Member 'AAOE_Blair_Base_C::AOE_NS_Blair_Skill01_DecalEnd' has a wrong offset!");
static_assert(offsetof(AAOE_Blair_Base_C, NS_Blair_Skill02_Mana_Proj) == 0x000840, "Member 'AAOE_Blair_Base_C::NS_Blair_Skill02_Mana_Proj' has a wrong offset!");
static_assert(offsetof(AAOE_Blair_Base_C, AOE_NS_Blair_Skill02_Mana_Creat) == 0x000848, "Member 'AAOE_Blair_Base_C::AOE_NS_Blair_Skill02_Mana_Creat' has a wrong offset!");
static_assert(offsetof(AAOE_Blair_Base_C, ConsumingTimeline_Offset_6CB354CA4F68577D6907A39CDC211FDC) == 0x000850, "Member 'AAOE_Blair_Base_C::ConsumingTimeline_Offset_6CB354CA4F68577D6907A39CDC211FDC' has a wrong offset!");
static_assert(offsetof(AAOE_Blair_Base_C, ConsumingTimeline_LerpAlpha_6CB354CA4F68577D6907A39CDC211FDC) == 0x00085C, "Member 'AAOE_Blair_Base_C::ConsumingTimeline_LerpAlpha_6CB354CA4F68577D6907A39CDC211FDC' has a wrong offset!");
static_assert(offsetof(AAOE_Blair_Base_C, ConsumingTimeline__Direction_6CB354CA4F68577D6907A39CDC211FDC) == 0x000860, "Member 'AAOE_Blair_Base_C::ConsumingTimeline__Direction_6CB354CA4F68577D6907A39CDC211FDC' has a wrong offset!");
static_assert(offsetof(AAOE_Blair_Base_C, ConsumingTimeline) == 0x000868, "Member 'AAOE_Blair_Base_C::ConsumingTimeline' has a wrong offset!");
static_assert(offsetof(AAOE_Blair_Base_C, StartConsumingLoc) == 0x000870, "Member 'AAOE_Blair_Base_C::StartConsumingLoc' has a wrong offset!");
static_assert(offsetof(AAOE_Blair_Base_C, DestConsumingOffset) == 0x00087C, "Member 'AAOE_Blair_Base_C::DestConsumingOffset' has a wrong offset!");
static_assert(offsetof(AAOE_Blair_Base_C, ConsumingOpTags) == 0x000888, "Member 'AAOE_Blair_Base_C::ConsumingOpTags' has a wrong offset!");
static_assert(offsetof(AAOE_Blair_Base_C, ConsumingEndFxTag) == 0x0008A8, "Member 'AAOE_Blair_Base_C::ConsumingEndFxTag' has a wrong offset!");
static_assert(offsetof(AAOE_Blair_Base_C, ProjSpawnAkEvent) == 0x0008B0, "Member 'AAOE_Blair_Base_C::ProjSpawnAkEvent' has a wrong offset!");
static_assert(offsetof(AAOE_Blair_Base_C, ProjDestroyAkEvent) == 0x0008B8, "Member 'AAOE_Blair_Base_C::ProjDestroyAkEvent' has a wrong offset!");
static_assert(offsetof(AAOE_Blair_Base_C, ConsumingCameraShake) == 0x0008C0, "Member 'AAOE_Blair_Base_C::ConsumingCameraShake' has a wrong offset!");
static_assert(offsetof(AAOE_Blair_Base_C, ConsumingCameraShakeRadius) == 0x0008C8, "Member 'AAOE_Blair_Base_C::ConsumingCameraShakeRadius' has a wrong offset!");
static_assert(offsetof(AAOE_Blair_Base_C, ConsumingCameraShakeDelay) == 0x0008CC, "Member 'AAOE_Blair_Base_C::ConsumingCameraShakeDelay' has a wrong offset!");
static_assert(offsetof(AAOE_Blair_Base_C, LoopFXs) == 0x0008D0, "Member 'AAOE_Blair_Base_C::LoopFXs' has a wrong offset!");

}

