#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Blair

#include "Basic.hpp"


namespace SDK::Params
{

// Function Blair.Blair_C.AddAOE
// 0x0010 (0x0010 - 0x0000)
struct Blair_C_AddAOE final
{
public:
	class AAOE_Blair_Base_C*                      NewAOE;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Blair_C_AddAOE) == 0x000008, "Wrong alignment on Blair_C_AddAOE");
static_assert(sizeof(Blair_C_AddAOE) == 0x000010, "Wrong size on Blair_C_AddAOE");
static_assert(offsetof(Blair_C_AddAOE, NewAOE) == 0x000000, "Member 'Blair_C_AddAOE::NewAOE' has a wrong offset!");
static_assert(offsetof(Blair_C_AddAOE, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'Blair_C_AddAOE::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blair_C_AddAOE, CallFunc_Array_Add_ReturnValue) == 0x00000C, "Member 'Blair_C_AddAOE::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function Blair.Blair_C.GetAOEs
// 0x0068 (0x0068 - 0x0000)
struct Blair_C_GetAOEs final
{
public:
	double                                        InRange;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AAOE_Blair_Base_C*>              AOEs;                                              // 0x0008(0x0010)(Parm, OutParm)
	TArray<class AAOE_Blair_Base_C*>              RetAOEs;                                           // 0x0018(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAOE_Blair_Base_C*                      CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHorizontalDistanceTo_ReturnValue;      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetRemainDuration_OutRemainDuration;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Blair_C_GetAOEs) == 0x000008, "Wrong alignment on Blair_C_GetAOEs");
static_assert(sizeof(Blair_C_GetAOEs) == 0x000068, "Wrong size on Blair_C_GetAOEs");
static_assert(offsetof(Blair_C_GetAOEs, InRange) == 0x000000, "Member 'Blair_C_GetAOEs::InRange' has a wrong offset!");
static_assert(offsetof(Blair_C_GetAOEs, AOEs) == 0x000008, "Member 'Blair_C_GetAOEs::AOEs' has a wrong offset!");
static_assert(offsetof(Blair_C_GetAOEs, RetAOEs) == 0x000018, "Member 'Blair_C_GetAOEs::RetAOEs' has a wrong offset!");
static_assert(offsetof(Blair_C_GetAOEs, Temp_int_Array_Index_Variable) == 0x000028, "Member 'Blair_C_GetAOEs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Blair_C_GetAOEs, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'Blair_C_GetAOEs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Blair_C_GetAOEs, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'Blair_C_GetAOEs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blair_C_GetAOEs, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'Blair_C_GetAOEs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blair_C_GetAOEs, CallFunc_Array_Get_Item) == 0x000038, "Member 'Blair_C_GetAOEs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Blair_C_GetAOEs, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'Blair_C_GetAOEs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blair_C_GetAOEs, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'Blair_C_GetAOEs::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blair_C_GetAOEs, CallFunc_Array_Add_ReturnValue) == 0x000044, "Member 'Blair_C_GetAOEs::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blair_C_GetAOEs, CallFunc_GetHorizontalDistanceTo_ReturnValue) == 0x000048, "Member 'Blair_C_GetAOEs::CallFunc_GetHorizontalDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blair_C_GetAOEs, CallFunc_GetRemainDuration_OutRemainDuration) == 0x000050, "Member 'Blair_C_GetAOEs::CallFunc_GetRemainDuration_OutRemainDuration' has a wrong offset!");
static_assert(offsetof(Blair_C_GetAOEs, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000058, "Member 'Blair_C_GetAOEs::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blair_C_GetAOEs, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000059, "Member 'Blair_C_GetAOEs::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blair_C_GetAOEs, CallFunc_BooleanAND_ReturnValue) == 0x00005A, "Member 'Blair_C_GetAOEs::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blair_C_GetAOEs, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000060, "Member 'Blair_C_GetAOEs::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function Blair.Blair_C.HasAOEs
// 0x0028 (0x0028 - 0x0000)
struct Blair_C_HasAOEs final
{
public:
	double                                        InRange;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bResult;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAOE_Blair_Base_C*>              CallFunc_GetAOEs_AOEs;                             // 0x0010(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Blair_C_HasAOEs) == 0x000008, "Wrong alignment on Blair_C_HasAOEs");
static_assert(sizeof(Blair_C_HasAOEs) == 0x000028, "Wrong size on Blair_C_HasAOEs");
static_assert(offsetof(Blair_C_HasAOEs, InRange) == 0x000000, "Member 'Blair_C_HasAOEs::InRange' has a wrong offset!");
static_assert(offsetof(Blair_C_HasAOEs, bResult) == 0x000008, "Member 'Blair_C_HasAOEs::bResult' has a wrong offset!");
static_assert(offsetof(Blair_C_HasAOEs, CallFunc_GetAOEs_AOEs) == 0x000010, "Member 'Blair_C_HasAOEs::CallFunc_GetAOEs_AOEs' has a wrong offset!");
static_assert(offsetof(Blair_C_HasAOEs, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'Blair_C_HasAOEs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blair_C_HasAOEs, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'Blair_C_HasAOEs::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function Blair.Blair_C.RemoveAOE
// 0x0010 (0x0010 - 0x0000)
struct Blair_C_RemoveAOE final
{
public:
	class AAOE_Blair_Base_C*                      RemoveAOE_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Blair_C_RemoveAOE) == 0x000008, "Wrong alignment on Blair_C_RemoveAOE");
static_assert(sizeof(Blair_C_RemoveAOE) == 0x000010, "Wrong size on Blair_C_RemoveAOE");
static_assert(offsetof(Blair_C_RemoveAOE, RemoveAOE_0) == 0x000000, "Member 'Blair_C_RemoveAOE::RemoveAOE_0' has a wrong offset!");
static_assert(offsetof(Blair_C_RemoveAOE, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'Blair_C_RemoveAOE::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Blair_C_RemoveAOE, CallFunc_Array_RemoveItem_ReturnValue) == 0x000009, "Member 'Blair_C_RemoveAOE::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

}

