#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Albion_Workshop_WeaponMade01

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Albion_Workshop_WeaponMade01.BP_Albion_Workshop_WeaponMade01_C.ExecuteUbergraph_BP_Albion_Workshop_WeaponMade01
// 0x000C (0x000C - 0x0000)
struct BP_Albion_Workshop_WeaponMade01_C_ExecuteUbergraph_BP_Albion_Workshop_WeaponMade01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Albion_Workshop_WeaponMade01_C_ExecuteUbergraph_BP_Albion_Workshop_WeaponMade01) == 0x000004, "Wrong alignment on BP_Albion_Workshop_WeaponMade01_C_ExecuteUbergraph_BP_Albion_Workshop_WeaponMade01");
static_assert(sizeof(BP_Albion_Workshop_WeaponMade01_C_ExecuteUbergraph_BP_Albion_Workshop_WeaponMade01) == 0x00000C, "Wrong size on BP_Albion_Workshop_WeaponMade01_C_ExecuteUbergraph_BP_Albion_Workshop_WeaponMade01");
static_assert(offsetof(BP_Albion_Workshop_WeaponMade01_C_ExecuteUbergraph_BP_Albion_Workshop_WeaponMade01, EntryPoint) == 0x000000, "Member 'BP_Albion_Workshop_WeaponMade01_C_ExecuteUbergraph_BP_Albion_Workshop_WeaponMade01::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Albion_Workshop_WeaponMade01_C_ExecuteUbergraph_BP_Albion_Workshop_WeaponMade01, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Albion_Workshop_WeaponMade01_C_ExecuteUbergraph_BP_Albion_Workshop_WeaponMade01::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Albion_Workshop_WeaponMade01_C_ExecuteUbergraph_BP_Albion_Workshop_WeaponMade01, CallFunc_Delay_Duration_ImplicitCast) == 0x000008, "Member 'BP_Albion_Workshop_WeaponMade01_C_ExecuteUbergraph_BP_Albion_Workshop_WeaponMade01::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function BP_Albion_Workshop_WeaponMade01.BP_Albion_Workshop_WeaponMade01_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Albion_Workshop_WeaponMade01_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Albion_Workshop_WeaponMade01_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Albion_Workshop_WeaponMade01_C_ReceiveTick");
static_assert(sizeof(BP_Albion_Workshop_WeaponMade01_C_ReceiveTick) == 0x000004, "Wrong size on BP_Albion_Workshop_WeaponMade01_C_ReceiveTick");
static_assert(offsetof(BP_Albion_Workshop_WeaponMade01_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Albion_Workshop_WeaponMade01_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

