#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Sec_NPC_007_A0101

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "M1AnimPhys_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Sec_NPC_007_A0101.BP_Sec_NPC_007_A0101_C
// 0x2430 (0x2750 - 0x0320)
class UBP_Sec_NPC_007_A0101_C final : public UAnimInstance
{
public:
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0328(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0330(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0338(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0358(0x00C8)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_8;                        // 0x0420(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_7;                        // 0x07F0(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_6;                        // 0x0BC0(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_5;                        // 0x0F90(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_4;                        // 0x1360(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_3;                        // 0x1730(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_2;                        // 0x1B00(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_1;                        // 0x1ED0(0x03D0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x22A0(0x00E0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys;                          // 0x2380(0x03D0)()

public:
	void ExecuteUbergraph_BP_Sec_NPC_007_A0101(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Sec_NPC_007_A0101_C">();
	}
	static class UBP_Sec_NPC_007_A0101_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Sec_NPC_007_A0101_C>();
	}
};
static_assert(alignof(UBP_Sec_NPC_007_A0101_C) == 0x000010, "Wrong alignment on UBP_Sec_NPC_007_A0101_C");
static_assert(sizeof(UBP_Sec_NPC_007_A0101_C) == 0x002750, "Wrong size on UBP_Sec_NPC_007_A0101_C");
static_assert(offsetof(UBP_Sec_NPC_007_A0101_C, UberGraphFrame) == 0x000320, "Member 'UBP_Sec_NPC_007_A0101_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_007_A0101_C, AnimBlueprintExtension_PropertyAccess) == 0x000328, "Member 'UBP_Sec_NPC_007_A0101_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_007_A0101_C, AnimBlueprintExtension_Base) == 0x000330, "Member 'UBP_Sec_NPC_007_A0101_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_007_A0101_C, AnimGraphNode_Root) == 0x000338, "Member 'UBP_Sec_NPC_007_A0101_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_007_A0101_C, AnimGraphNode_LinkedInputPose) == 0x000358, "Member 'UBP_Sec_NPC_007_A0101_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_007_A0101_C, M1AnimGraphNode_AnimPhys_8) == 0x000420, "Member 'UBP_Sec_NPC_007_A0101_C::M1AnimGraphNode_AnimPhys_8' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_007_A0101_C, M1AnimGraphNode_AnimPhys_7) == 0x0007F0, "Member 'UBP_Sec_NPC_007_A0101_C::M1AnimGraphNode_AnimPhys_7' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_007_A0101_C, M1AnimGraphNode_AnimPhys_6) == 0x000BC0, "Member 'UBP_Sec_NPC_007_A0101_C::M1AnimGraphNode_AnimPhys_6' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_007_A0101_C, M1AnimGraphNode_AnimPhys_5) == 0x000F90, "Member 'UBP_Sec_NPC_007_A0101_C::M1AnimGraphNode_AnimPhys_5' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_007_A0101_C, M1AnimGraphNode_AnimPhys_4) == 0x001360, "Member 'UBP_Sec_NPC_007_A0101_C::M1AnimGraphNode_AnimPhys_4' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_007_A0101_C, M1AnimGraphNode_AnimPhys_3) == 0x001730, "Member 'UBP_Sec_NPC_007_A0101_C::M1AnimGraphNode_AnimPhys_3' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_007_A0101_C, M1AnimGraphNode_AnimPhys_2) == 0x001B00, "Member 'UBP_Sec_NPC_007_A0101_C::M1AnimGraphNode_AnimPhys_2' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_007_A0101_C, M1AnimGraphNode_AnimPhys_1) == 0x001ED0, "Member 'UBP_Sec_NPC_007_A0101_C::M1AnimGraphNode_AnimPhys_1' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_007_A0101_C, AnimGraphNode_LayeredBoneBlend) == 0x0022A0, "Member 'UBP_Sec_NPC_007_A0101_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_007_A0101_C, M1AnimGraphNode_AnimPhys) == 0x002380, "Member 'UBP_Sec_NPC_007_A0101_C::M1AnimGraphNode_AnimPhys' has a wrong offset!");

}

