#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Sec_NPC_037_A0101

#include "Basic.hpp"

#include "M1AnimPhys_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Sec_NPC_037_A0101.BP_Sec_NPC_037_A0101_C
// 0x28A0 (0x2BC0 - 0x0320)
class UBP_Sec_NPC_037_A0101_C final : public UAnimInstance
{
public:
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0328(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0330(0x0008)()
	uint8                                         Pad_338[0x8];                                      // 0x0338(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x0340(0x0280)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x05C0(0x0020)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_8;                        // 0x05E0(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_7;                        // 0x09B0(0x03D0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0D80(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x0DA0(0x0280)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_6;                        // 0x1020(0x03D0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x13F0(0x00C8)()
	uint8                                         Pad_14B8[0x8];                                     // 0x14B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_5;                        // 0x14C0(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_4;                        // 0x1890(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_3;                        // 0x1C60(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_2;                        // 0x2030(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_1;                        // 0x2400(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys;                          // 0x27D0(0x03D0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2BA0(0x0020)()

public:
	void ExecuteUbergraph_BP_Sec_NPC_037_A0101(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Sec_NPC_037_A0101_C">();
	}
	static class UBP_Sec_NPC_037_A0101_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Sec_NPC_037_A0101_C>();
	}
};
static_assert(alignof(UBP_Sec_NPC_037_A0101_C) == 0x000010, "Wrong alignment on UBP_Sec_NPC_037_A0101_C");
static_assert(sizeof(UBP_Sec_NPC_037_A0101_C) == 0x002BC0, "Wrong size on UBP_Sec_NPC_037_A0101_C");
static_assert(offsetof(UBP_Sec_NPC_037_A0101_C, UberGraphFrame) == 0x000320, "Member 'UBP_Sec_NPC_037_A0101_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_037_A0101_C, AnimBlueprintExtension_PropertyAccess) == 0x000328, "Member 'UBP_Sec_NPC_037_A0101_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_037_A0101_C, AnimBlueprintExtension_Base) == 0x000330, "Member 'UBP_Sec_NPC_037_A0101_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_037_A0101_C, AnimGraphNode_KawaiiPhysics_1) == 0x000340, "Member 'UBP_Sec_NPC_037_A0101_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_037_A0101_C, AnimGraphNode_LocalToComponentSpace) == 0x0005C0, "Member 'UBP_Sec_NPC_037_A0101_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_037_A0101_C, M1AnimGraphNode_AnimPhys_8) == 0x0005E0, "Member 'UBP_Sec_NPC_037_A0101_C::M1AnimGraphNode_AnimPhys_8' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_037_A0101_C, M1AnimGraphNode_AnimPhys_7) == 0x0009B0, "Member 'UBP_Sec_NPC_037_A0101_C::M1AnimGraphNode_AnimPhys_7' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_037_A0101_C, AnimGraphNode_ComponentToLocalSpace) == 0x000D80, "Member 'UBP_Sec_NPC_037_A0101_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_037_A0101_C, AnimGraphNode_KawaiiPhysics) == 0x000DA0, "Member 'UBP_Sec_NPC_037_A0101_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_037_A0101_C, M1AnimGraphNode_AnimPhys_6) == 0x001020, "Member 'UBP_Sec_NPC_037_A0101_C::M1AnimGraphNode_AnimPhys_6' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_037_A0101_C, AnimGraphNode_LinkedInputPose) == 0x0013F0, "Member 'UBP_Sec_NPC_037_A0101_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_037_A0101_C, M1AnimGraphNode_AnimPhys_5) == 0x0014C0, "Member 'UBP_Sec_NPC_037_A0101_C::M1AnimGraphNode_AnimPhys_5' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_037_A0101_C, M1AnimGraphNode_AnimPhys_4) == 0x001890, "Member 'UBP_Sec_NPC_037_A0101_C::M1AnimGraphNode_AnimPhys_4' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_037_A0101_C, M1AnimGraphNode_AnimPhys_3) == 0x001C60, "Member 'UBP_Sec_NPC_037_A0101_C::M1AnimGraphNode_AnimPhys_3' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_037_A0101_C, M1AnimGraphNode_AnimPhys_2) == 0x002030, "Member 'UBP_Sec_NPC_037_A0101_C::M1AnimGraphNode_AnimPhys_2' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_037_A0101_C, M1AnimGraphNode_AnimPhys_1) == 0x002400, "Member 'UBP_Sec_NPC_037_A0101_C::M1AnimGraphNode_AnimPhys_1' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_037_A0101_C, M1AnimGraphNode_AnimPhys) == 0x0027D0, "Member 'UBP_Sec_NPC_037_A0101_C::M1AnimGraphNode_AnimPhys' has a wrong offset!");
static_assert(offsetof(UBP_Sec_NPC_037_A0101_C, AnimGraphNode_Root) == 0x002BA0, "Member 'UBP_Sec_NPC_037_A0101_C::AnimGraphNode_Root' has a wrong offset!");

}

