#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Sec_PC_010_A_F_BODY_006

#include "Basic.hpp"

#include "M1_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "M1AnimPhys_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Sec_PC_010_A_F_BODY_006.BP_Sec_PC_010_A_F_BODY_006_C
// 0x19F0 (0x1D10 - 0x0320)
class UBP_Sec_PC_010_A_F_BODY_006_C final : public UAnimInstance
{
public:
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0328(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0330(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0338(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0358(0x00C8)()
	struct FM1AnimNode_ApplyFacialAdditive        M1AnimGraphNode_ApplyFacialAdditive;               // 0x0420(0x0098)()
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_5;                        // 0x04C0(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_4;                        // 0x0890(0x03D0)()
	struct FM1AnimNode_ModifyBone_Expression      M1AnimGraphNode_ModifyBone_Expression;             // 0x0C60(0x0170)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_3;                        // 0x0DD0(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_2;                        // 0x11A0(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_1;                        // 0x1570(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys;                          // 0x1940(0x03D0)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_BP_Sec_PC_010_A_F_BODY_006(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Sec_PC_010_A_F_BODY_006_C">();
	}
	static class UBP_Sec_PC_010_A_F_BODY_006_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Sec_PC_010_A_F_BODY_006_C>();
	}
};
static_assert(alignof(UBP_Sec_PC_010_A_F_BODY_006_C) == 0x000010, "Wrong alignment on UBP_Sec_PC_010_A_F_BODY_006_C");
static_assert(sizeof(UBP_Sec_PC_010_A_F_BODY_006_C) == 0x001D10, "Wrong size on UBP_Sec_PC_010_A_F_BODY_006_C");
static_assert(offsetof(UBP_Sec_PC_010_A_F_BODY_006_C, UberGraphFrame) == 0x000320, "Member 'UBP_Sec_PC_010_A_F_BODY_006_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_010_A_F_BODY_006_C, AnimBlueprintExtension_PropertyAccess) == 0x000328, "Member 'UBP_Sec_PC_010_A_F_BODY_006_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_010_A_F_BODY_006_C, AnimBlueprintExtension_Base) == 0x000330, "Member 'UBP_Sec_PC_010_A_F_BODY_006_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_010_A_F_BODY_006_C, AnimGraphNode_Root) == 0x000338, "Member 'UBP_Sec_PC_010_A_F_BODY_006_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_010_A_F_BODY_006_C, AnimGraphNode_LinkedInputPose) == 0x000358, "Member 'UBP_Sec_PC_010_A_F_BODY_006_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_010_A_F_BODY_006_C, M1AnimGraphNode_ApplyFacialAdditive) == 0x000420, "Member 'UBP_Sec_PC_010_A_F_BODY_006_C::M1AnimGraphNode_ApplyFacialAdditive' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_010_A_F_BODY_006_C, M1AnimGraphNode_AnimPhys_5) == 0x0004C0, "Member 'UBP_Sec_PC_010_A_F_BODY_006_C::M1AnimGraphNode_AnimPhys_5' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_010_A_F_BODY_006_C, M1AnimGraphNode_AnimPhys_4) == 0x000890, "Member 'UBP_Sec_PC_010_A_F_BODY_006_C::M1AnimGraphNode_AnimPhys_4' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_010_A_F_BODY_006_C, M1AnimGraphNode_ModifyBone_Expression) == 0x000C60, "Member 'UBP_Sec_PC_010_A_F_BODY_006_C::M1AnimGraphNode_ModifyBone_Expression' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_010_A_F_BODY_006_C, M1AnimGraphNode_AnimPhys_3) == 0x000DD0, "Member 'UBP_Sec_PC_010_A_F_BODY_006_C::M1AnimGraphNode_AnimPhys_3' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_010_A_F_BODY_006_C, M1AnimGraphNode_AnimPhys_2) == 0x0011A0, "Member 'UBP_Sec_PC_010_A_F_BODY_006_C::M1AnimGraphNode_AnimPhys_2' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_010_A_F_BODY_006_C, M1AnimGraphNode_AnimPhys_1) == 0x001570, "Member 'UBP_Sec_PC_010_A_F_BODY_006_C::M1AnimGraphNode_AnimPhys_1' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_010_A_F_BODY_006_C, M1AnimGraphNode_AnimPhys) == 0x001940, "Member 'UBP_Sec_PC_010_A_F_BODY_006_C::M1AnimGraphNode_AnimPhys' has a wrong offset!");

}

