#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Sec_PC_015_A0101

#include "Basic.hpp"

#include "M1_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Sec_PC_015_A0101.BP_Sec_PC_015_A0101_C
// 0x0310 (0x0630 - 0x0320)
class UBP_Sec_PC_015_A0101_C final : public UAnimInstance
{
public:
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0328(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0330(0x0008)()
	struct FM1AnimNode_ApplyFacialAdditive        M1AnimGraphNode_ApplyFacialAdditive;               // 0x0338(0x0098)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03D0(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0498(0x0020)()
	struct FM1AnimNode_ModifyBone_Expression      M1AnimGraphNode_ModifyBone_Expression;             // 0x04B8(0x0170)()
	double                                        KawaiiAlpha;                                       // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Sec_PC_015_A0101(int32 EntryPoint);
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Sec_PC_015_A0101_C">();
	}
	static class UBP_Sec_PC_015_A0101_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Sec_PC_015_A0101_C>();
	}
};
static_assert(alignof(UBP_Sec_PC_015_A0101_C) == 0x000010, "Wrong alignment on UBP_Sec_PC_015_A0101_C");
static_assert(sizeof(UBP_Sec_PC_015_A0101_C) == 0x000630, "Wrong size on UBP_Sec_PC_015_A0101_C");
static_assert(offsetof(UBP_Sec_PC_015_A0101_C, UberGraphFrame) == 0x000320, "Member 'UBP_Sec_PC_015_A0101_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_015_A0101_C, AnimBlueprintExtension_PropertyAccess) == 0x000328, "Member 'UBP_Sec_PC_015_A0101_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_015_A0101_C, AnimBlueprintExtension_Base) == 0x000330, "Member 'UBP_Sec_PC_015_A0101_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_015_A0101_C, M1AnimGraphNode_ApplyFacialAdditive) == 0x000338, "Member 'UBP_Sec_PC_015_A0101_C::M1AnimGraphNode_ApplyFacialAdditive' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_015_A0101_C, AnimGraphNode_LinkedInputPose) == 0x0003D0, "Member 'UBP_Sec_PC_015_A0101_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_015_A0101_C, AnimGraphNode_Root) == 0x000498, "Member 'UBP_Sec_PC_015_A0101_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_015_A0101_C, M1AnimGraphNode_ModifyBone_Expression) == 0x0004B8, "Member 'UBP_Sec_PC_015_A0101_C::M1AnimGraphNode_ModifyBone_Expression' has a wrong offset!");
static_assert(offsetof(UBP_Sec_PC_015_A0101_C, KawaiiAlpha) == 0x000628, "Member 'UBP_Sec_PC_015_A0101_C::KawaiiAlpha' has a wrong offset!");

}

