#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BR_1005_0

#include "Basic.hpp"

#include "M1_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BR_1005.BR_1005_C
// 0x0018 (0x0478 - 0x0460)
class ABR_1005_C final : public AM1Weapon
{
public:
	class UKingsGuardlanceInstantHitComponent_C*  KingsGuardlanceInstantHitComponent;                // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UM1WeaponChargeComponent*               M1WeaponCharge;                                    // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UM1WeaponMagazineReloadComponent*       M1WeaponMagazineReload;                            // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BR_1005_C">();
	}
	static class ABR_1005_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABR_1005_C>();
	}
};
static_assert(alignof(ABR_1005_C) == 0x000008, "Wrong alignment on ABR_1005_C");
static_assert(sizeof(ABR_1005_C) == 0x000478, "Wrong size on ABR_1005_C");
static_assert(offsetof(ABR_1005_C, KingsGuardlanceInstantHitComponent) == 0x000460, "Member 'ABR_1005_C::KingsGuardlanceInstantHitComponent' has a wrong offset!");
static_assert(offsetof(ABR_1005_C, M1WeaponCharge) == 0x000468, "Member 'ABR_1005_C::M1WeaponCharge' has a wrong offset!");
static_assert(offsetof(ABR_1005_C, M1WeaponMagazineReload) == 0x000470, "Member 'ABR_1005_C::M1WeaponMagazineReload' has a wrong offset!");

}

