#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_007_Head_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function F_007_Head_BP.F_007_Head_BP_C.ExecuteUbergraph_F_007_Head_BP
// 0x0004 (0x0004 - 0x0000)
struct F_007_Head_BP_C_ExecuteUbergraph_F_007_Head_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_007_Head_BP_C_ExecuteUbergraph_F_007_Head_BP) == 0x000004, "Wrong alignment on F_007_Head_BP_C_ExecuteUbergraph_F_007_Head_BP");
static_assert(sizeof(F_007_Head_BP_C_ExecuteUbergraph_F_007_Head_BP) == 0x000004, "Wrong size on F_007_Head_BP_C_ExecuteUbergraph_F_007_Head_BP");
static_assert(offsetof(F_007_Head_BP_C_ExecuteUbergraph_F_007_Head_BP, EntryPoint) == 0x000000, "Member 'F_007_Head_BP_C_ExecuteUbergraph_F_007_Head_BP::EntryPoint' has a wrong offset!");

// Function F_007_Head_BP.F_007_Head_BP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct F_007_Head_BP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(F_007_Head_BP_C_AnimGraph) == 0x000008, "Wrong alignment on F_007_Head_BP_C_AnimGraph");
static_assert(sizeof(F_007_Head_BP_C_AnimGraph) == 0x000010, "Wrong size on F_007_Head_BP_C_AnimGraph");
static_assert(offsetof(F_007_Head_BP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'F_007_Head_BP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

