#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_007_Head_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct F_007_Head_BP.F_007_Head_BP_C.AnimBlueprintGeneratedMutableData
// 0x000F (0x0010 - 0x0001)
struct F_007_Head_BP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_007_Head_BP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on F_007_Head_BP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(F_007_Head_BP::FAnimBlueprintGeneratedMutableData) == 0x000010, "Wrong size on F_007_Head_BP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(F_007_Head_BP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'F_007_Head_BP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(F_007_Head_BP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'F_007_Head_BP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(F_007_Head_BP::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x00000C, "Member 'F_007_Head_BP::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");

// ScriptStruct F_007_Head_BP.F_007_Head_BP_C.AnimBlueprintGeneratedConstantData
// 0x0137 (0x0138 - 0x0001)
struct F_007_Head_BP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_38;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_39;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_40;                                   // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_41;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_42;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_43;                                // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_44;                               // 0x0038(0x0020)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_45;                                 // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_46;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_47;                               // 0x0060(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_48;                                // 0x008C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_49;                                 // 0x0090(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_50;                                 // 0x0091(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_51;                                 // 0x0092(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x1];                                       // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_52;                                 // 0x0094(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0120(0x0018)()
};
static_assert(alignof(F_007_Head_BP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on F_007_Head_BP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(F_007_Head_BP::FAnimBlueprintGeneratedConstantData) == 0x000138, "Wrong size on F_007_Head_BP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(F_007_Head_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_38) == 0x000004, "Member 'F_007_Head_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_38' has a wrong offset!");
static_assert(offsetof(F_007_Head_BP::FAnimBlueprintGeneratedConstantData, __BlendProfile_39) == 0x000010, "Member 'F_007_Head_BP::FAnimBlueprintGeneratedConstantData::__BlendProfile_39' has a wrong offset!");
static_assert(offsetof(F_007_Head_BP::FAnimBlueprintGeneratedConstantData, __CurveFloat_40) == 0x000018, "Member 'F_007_Head_BP::FAnimBlueprintGeneratedConstantData::__CurveFloat_40' has a wrong offset!");
static_assert(offsetof(F_007_Head_BP::FAnimBlueprintGeneratedConstantData, __EnumProperty_41) == 0x000020, "Member 'F_007_Head_BP::FAnimBlueprintGeneratedConstantData::__EnumProperty_41' has a wrong offset!");
static_assert(offsetof(F_007_Head_BP::FAnimBlueprintGeneratedConstantData, __EnumProperty_42) == 0x000021, "Member 'F_007_Head_BP::FAnimBlueprintGeneratedConstantData::__EnumProperty_42' has a wrong offset!");
static_assert(offsetof(F_007_Head_BP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_43) == 0x000028, "Member 'F_007_Head_BP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_43' has a wrong offset!");
static_assert(offsetof(F_007_Head_BP::FAnimBlueprintGeneratedConstantData, __StructProperty_44) == 0x000038, "Member 'F_007_Head_BP::FAnimBlueprintGeneratedConstantData::__StructProperty_44' has a wrong offset!");
static_assert(offsetof(F_007_Head_BP::FAnimBlueprintGeneratedConstantData, __BoolProperty_45) == 0x000058, "Member 'F_007_Head_BP::FAnimBlueprintGeneratedConstantData::__BoolProperty_45' has a wrong offset!");
static_assert(offsetof(F_007_Head_BP::FAnimBlueprintGeneratedConstantData, __FloatProperty_46) == 0x00005C, "Member 'F_007_Head_BP::FAnimBlueprintGeneratedConstantData::__FloatProperty_46' has a wrong offset!");
static_assert(offsetof(F_007_Head_BP::FAnimBlueprintGeneratedConstantData, __StructProperty_47) == 0x000060, "Member 'F_007_Head_BP::FAnimBlueprintGeneratedConstantData::__StructProperty_47' has a wrong offset!");
static_assert(offsetof(F_007_Head_BP::FAnimBlueprintGeneratedConstantData, __FloatProperty_48) == 0x00008C, "Member 'F_007_Head_BP::FAnimBlueprintGeneratedConstantData::__FloatProperty_48' has a wrong offset!");
static_assert(offsetof(F_007_Head_BP::FAnimBlueprintGeneratedConstantData, __BoolProperty_49) == 0x000090, "Member 'F_007_Head_BP::FAnimBlueprintGeneratedConstantData::__BoolProperty_49' has a wrong offset!");
static_assert(offsetof(F_007_Head_BP::FAnimBlueprintGeneratedConstantData, __EnumProperty_50) == 0x000091, "Member 'F_007_Head_BP::FAnimBlueprintGeneratedConstantData::__EnumProperty_50' has a wrong offset!");
static_assert(offsetof(F_007_Head_BP::FAnimBlueprintGeneratedConstantData, __ByteProperty_51) == 0x000092, "Member 'F_007_Head_BP::FAnimBlueprintGeneratedConstantData::__ByteProperty_51' has a wrong offset!");
static_assert(offsetof(F_007_Head_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_52) == 0x000094, "Member 'F_007_Head_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_52' has a wrong offset!");
static_assert(offsetof(F_007_Head_BP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A0, "Member 'F_007_Head_BP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(F_007_Head_BP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000120, "Member 'F_007_Head_BP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

