#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IK

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "M1_structs.hpp"
#include "M1_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimationWarpingRuntime_structs.hpp"
#include "IK_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass IK.IK_C
// 0x1160 (0x16C0 - 0x0560)
class UIK_C final : public UM1IKAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0560(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct IK::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0568(0x0014)(HasGetValueTypeHash)
	uint8                                         Pad_57C[0x4];                                      // 0x057C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0580(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0588(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0590(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x05B0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x05D0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x05F0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x06F8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0800(0x0108)()
	uint8                                         Pad_908[0x8];                                      // 0x0908(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_2;                         // 0x0910(0x01F0)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1;                         // 0x0B00(0x01F0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0CF0(0x00C8)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0DB8(0x0010)()
	struct FM1AnimNode_ModifyBone_Multi           M1AnimGraphNode_ModifyBone_Multi;                  // 0x0DC8(0x00F0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x0EB8(0x0048)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x0F00(0x01F0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x10F0(0x0108)()
	uint8                                         Pad_11F8[0x8];                                     // 0x11F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AnimNode_LinkConstraint             M1AnimGraphNode_LinkConstraint;                    // 0x1200(0x0120)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x1320(0x0070)()
	struct FAnimNode_StrideWarping                AnimGraphNode_StrideWarping;                       // 0x1390(0x01F0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x1580(0x0070)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x15F0(0x00C8)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_IK_AnimGraphNode_ModifyBone_094E76584483542189869F8BD7F61EA7();
	void ExecuteUbergraph_IK(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IK_C">();
	}
	static class UIK_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIK_C>();
	}
};
static_assert(alignof(UIK_C) == 0x000010, "Wrong alignment on UIK_C");
static_assert(sizeof(UIK_C) == 0x0016C0, "Wrong size on UIK_C");
static_assert(offsetof(UIK_C, UberGraphFrame) == 0x000560, "Member 'UIK_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIK_C, __AnimBlueprintMutables) == 0x000568, "Member 'UIK_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UIK_C, AnimBlueprintExtension_PropertyAccess) == 0x000580, "Member 'UIK_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UIK_C, AnimBlueprintExtension_Base) == 0x000588, "Member 'UIK_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UIK_C, AnimGraphNode_Root) == 0x000590, "Member 'UIK_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UIK_C, AnimGraphNode_LocalToComponentSpace) == 0x0005B0, "Member 'UIK_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UIK_C, AnimGraphNode_ComponentToLocalSpace) == 0x0005D0, "Member 'UIK_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UIK_C, AnimGraphNode_ModifyBone_3) == 0x0005F0, "Member 'UIK_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UIK_C, AnimGraphNode_ModifyBone_2) == 0x0006F8, "Member 'UIK_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UIK_C, AnimGraphNode_ModifyBone_1) == 0x000800, "Member 'UIK_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UIK_C, AnimGraphNode_TwoBoneIK_2) == 0x000910, "Member 'UIK_C::AnimGraphNode_TwoBoneIK_2' has a wrong offset!");
static_assert(offsetof(UIK_C, AnimGraphNode_TwoBoneIK_1) == 0x000B00, "Member 'UIK_C::AnimGraphNode_TwoBoneIK_1' has a wrong offset!");
static_assert(offsetof(UIK_C, AnimGraphNode_LinkedInputPose) == 0x000CF0, "Member 'UIK_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UIK_C, AnimGraphNode_LocalRefPose) == 0x000DB8, "Member 'UIK_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UIK_C, M1AnimGraphNode_ModifyBone_Multi) == 0x000DC8, "Member 'UIK_C::M1AnimGraphNode_ModifyBone_Multi' has a wrong offset!");
static_assert(offsetof(UIK_C, AnimGraphNode_BlendListByEnum) == 0x000EB8, "Member 'UIK_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(UIK_C, AnimGraphNode_TwoBoneIK) == 0x000F00, "Member 'UIK_C::AnimGraphNode_TwoBoneIK' has a wrong offset!");
static_assert(offsetof(UIK_C, AnimGraphNode_ModifyBone) == 0x0010F0, "Member 'UIK_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UIK_C, M1AnimGraphNode_LinkConstraint) == 0x001200, "Member 'UIK_C::M1AnimGraphNode_LinkConstraint' has a wrong offset!");
static_assert(offsetof(UIK_C, AnimGraphNode_BlendSpacePlayer_1) == 0x001320, "Member 'UIK_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UIK_C, AnimGraphNode_StrideWarping) == 0x001390, "Member 'UIK_C::AnimGraphNode_StrideWarping' has a wrong offset!");
static_assert(offsetof(UIK_C, AnimGraphNode_BlendSpacePlayer) == 0x001580, "Member 'UIK_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UIK_C, AnimGraphNode_ApplyAdditive) == 0x0015F0, "Member 'UIK_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");

}

