#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KingsGuardlanceInstantHitComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function KingsGuardlanceInstantHitComponent.KingsGuardlanceInstantHitComponent_C.BP_FilterHitResults
// 0x01A0 (0x01A0 - 0x0000)
struct KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults final
{
public:
	TArray<struct FHitResult>                     HitResults;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<struct FHitResult>                     ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<struct FHitResult>                     FilteredHitResults;                                // 0x0020(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0038(0x009C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAbilityActor_KingsGuardlance_C*        K2Node_DynamicCast_AsAbility_Actor_Kings_Guardlance; // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAbilityInstigator_ReturnValue;         // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults) == 0x000008, "Wrong alignment on KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults");
static_assert(sizeof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults) == 0x0001A0, "Wrong size on KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, HitResults) == 0x000000, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::HitResults' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, ReturnValue) == 0x000010, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::ReturnValue' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, FilteredHitResults) == 0x000020, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::FilteredHitResults' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, Temp_int_Array_Index_Variable) == 0x000030, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_Array_Get_Item) == 0x000038, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_BreakHitResult_bBlockingHit) == 0x0000D4, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000D5, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_BreakHitResult_Time) == 0x0000D8, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_BreakHitResult_Distance) == 0x0000DC, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_BreakHitResult_Location) == 0x0000E0, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_BreakHitResult_ImpactPoint) == 0x0000EC, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_BreakHitResult_Normal) == 0x0000F8, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_BreakHitResult_ImpactNormal) == 0x000104, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_BreakHitResult_PhysMat) == 0x000110, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_BreakHitResult_HitActor) == 0x000118, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_BreakHitResult_HitComponent) == 0x000120, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_BreakHitResult_HitBoneName) == 0x000128, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_BreakHitResult_BoneName) == 0x000130, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_BreakHitResult_HitItem) == 0x000138, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_BreakHitResult_ElementIndex) == 0x00013C, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_BreakHitResult_FaceIndex) == 0x000140, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_BreakHitResult_TraceStart) == 0x000144, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_BreakHitResult_TraceEnd) == 0x000150, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, K2Node_DynamicCast_AsAbility_Actor_Kings_Guardlance) == 0x000160, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::K2Node_DynamicCast_AsAbility_Actor_Kings_Guardlance' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_GetOwner_ReturnValue) == 0x000170, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_GetAbilityInstigator_ReturnValue) == 0x000178, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_GetAbilityInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_GetOwner_ReturnValue_1) == 0x000180, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000188, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_Array_Add_ReturnValue) == 0x00018C, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_Array_Add_ReturnValue_1) == 0x000190, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, Temp_int_Loop_Counter_Variable) == 0x000194, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_Less_IntInt_ReturnValue) == 0x000198, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults, CallFunc_Add_IntInt_ReturnValue) == 0x00019C, "Member 'KingsGuardlanceInstantHitComponent_C_BP_FilterHitResults::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

