#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LNC_1004

#include "Basic.hpp"

#include "M1_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LNC_1004.LNC_1004_C
// 0x0018 (0x0478 - 0x0460)
class ALNC_1004_C final : public AM1Weapon
{
public:
	class UM1WeaponMagazineReloadComponent*       M1WeaponMagazineReload;                            // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UM1WeaponGuideVfxComponent*             M1WeaponGuideVfx;                                  // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UM1WeaponLauncherComponent*             M1WeaponLauncher;                                  // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LNC_1004_C">();
	}
	static class ALNC_1004_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALNC_1004_C>();
	}
};
static_assert(alignof(ALNC_1004_C) == 0x000008, "Wrong alignment on ALNC_1004_C");
static_assert(sizeof(ALNC_1004_C) == 0x000478, "Wrong size on ALNC_1004_C");
static_assert(offsetof(ALNC_1004_C, M1WeaponMagazineReload) == 0x000460, "Member 'ALNC_1004_C::M1WeaponMagazineReload' has a wrong offset!");
static_assert(offsetof(ALNC_1004_C, M1WeaponGuideVfx) == 0x000468, "Member 'ALNC_1004_C::M1WeaponGuideVfx' has a wrong offset!");
static_assert(offsetof(ALNC_1004_C, M1WeaponLauncher) == 0x000470, "Member 'ALNC_1004_C::M1WeaponLauncher' has a wrong offset!");

}

