#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_014_Specification_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function M_014_Specification_BP.M_014_Specification_BP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct M_014_Specification_BP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(M_014_Specification_BP_C_AnimGraph) == 0x000008, "Wrong alignment on M_014_Specification_BP_C_AnimGraph");
static_assert(sizeof(M_014_Specification_BP_C_AnimGraph) == 0x000010, "Wrong size on M_014_Specification_BP_C_AnimGraph");
static_assert(offsetof(M_014_Specification_BP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'M_014_Specification_BP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function M_014_Specification_BP.M_014_Specification_BP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct M_014_Specification_BP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_014_Specification_BP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on M_014_Specification_BP_C_BlueprintUpdateAnimation");
static_assert(sizeof(M_014_Specification_BP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on M_014_Specification_BP_C_BlueprintUpdateAnimation");
static_assert(offsetof(M_014_Specification_BP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'M_014_Specification_BP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function M_014_Specification_BP.M_014_Specification_BP_C.ExecuteUbergraph_M_014_Specification_BP
// 0x0018 (0x0018 - 0x0000)
struct M_014_Specification_BP_C_ExecuteUbergraph_M_014_Specification_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAimAOPitch_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_014_Specification_BP_C_ExecuteUbergraph_M_014_Specification_BP) == 0x000008, "Wrong alignment on M_014_Specification_BP_C_ExecuteUbergraph_M_014_Specification_BP");
static_assert(sizeof(M_014_Specification_BP_C_ExecuteUbergraph_M_014_Specification_BP) == 0x000018, "Wrong size on M_014_Specification_BP_C_ExecuteUbergraph_M_014_Specification_BP");
static_assert(offsetof(M_014_Specification_BP_C_ExecuteUbergraph_M_014_Specification_BP, EntryPoint) == 0x000000, "Member 'M_014_Specification_BP_C_ExecuteUbergraph_M_014_Specification_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(M_014_Specification_BP_C_ExecuteUbergraph_M_014_Specification_BP, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'M_014_Specification_BP_C_ExecuteUbergraph_M_014_Specification_BP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(M_014_Specification_BP_C_ExecuteUbergraph_M_014_Specification_BP, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'M_014_Specification_BP_C_ExecuteUbergraph_M_014_Specification_BP::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_014_Specification_BP_C_ExecuteUbergraph_M_014_Specification_BP, CallFunc_GetAimAOPitch_ReturnValue) == 0x000010, "Member 'M_014_Specification_BP_C_ExecuteUbergraph_M_014_Specification_BP::CallFunc_GetAimAOPitch_ReturnValue' has a wrong offset!");

// Function M_014_Specification_BP.M_014_Specification_BP_C.SpecificationLayer
// 0x0020 (0x0020 - 0x0000)
struct M_014_Specification_BP_C_SpecificationLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              SpecificationLayer_0;                              // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(M_014_Specification_BP_C_SpecificationLayer) == 0x000008, "Wrong alignment on M_014_Specification_BP_C_SpecificationLayer");
static_assert(sizeof(M_014_Specification_BP_C_SpecificationLayer) == 0x000020, "Wrong size on M_014_Specification_BP_C_SpecificationLayer");
static_assert(offsetof(M_014_Specification_BP_C_SpecificationLayer, InPose) == 0x000000, "Member 'M_014_Specification_BP_C_SpecificationLayer::InPose' has a wrong offset!");
static_assert(offsetof(M_014_Specification_BP_C_SpecificationLayer, SpecificationLayer_0) == 0x000010, "Member 'M_014_Specification_BP_C_SpecificationLayer::SpecificationLayer_0' has a wrong offset!");

}

