#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_014_Specification_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct M_014_Specification_BP.M_014_Specification_BP_C.AnimBlueprintGeneratedConstantData
// 0x013F (0x0140 - 0x0001)
struct M_014_Specification_BP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_70;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_71;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_72;                                   // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_73;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_74;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_75;                                // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_76;                                 // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_77;                               // 0x0040(0x0020)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_78;                                 // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_79;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_80;                               // 0x0068(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_81;                                // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_82;                                 // 0x0098(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_83;                                 // 0x0099(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_84;                                 // 0x009A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_85;                                 // 0x009C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0128(0x0018)()
};
static_assert(alignof(M_014_Specification_BP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on M_014_Specification_BP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(M_014_Specification_BP::FAnimBlueprintGeneratedConstantData) == 0x000140, "Wrong size on M_014_Specification_BP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(M_014_Specification_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_70) == 0x000004, "Member 'M_014_Specification_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_70' has a wrong offset!");
static_assert(offsetof(M_014_Specification_BP::FAnimBlueprintGeneratedConstantData, __BlendProfile_71) == 0x000010, "Member 'M_014_Specification_BP::FAnimBlueprintGeneratedConstantData::__BlendProfile_71' has a wrong offset!");
static_assert(offsetof(M_014_Specification_BP::FAnimBlueprintGeneratedConstantData, __CurveFloat_72) == 0x000018, "Member 'M_014_Specification_BP::FAnimBlueprintGeneratedConstantData::__CurveFloat_72' has a wrong offset!");
static_assert(offsetof(M_014_Specification_BP::FAnimBlueprintGeneratedConstantData, __EnumProperty_73) == 0x000020, "Member 'M_014_Specification_BP::FAnimBlueprintGeneratedConstantData::__EnumProperty_73' has a wrong offset!");
static_assert(offsetof(M_014_Specification_BP::FAnimBlueprintGeneratedConstantData, __EnumProperty_74) == 0x000021, "Member 'M_014_Specification_BP::FAnimBlueprintGeneratedConstantData::__EnumProperty_74' has a wrong offset!");
static_assert(offsetof(M_014_Specification_BP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_75) == 0x000028, "Member 'M_014_Specification_BP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_75' has a wrong offset!");
static_assert(offsetof(M_014_Specification_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_76) == 0x000038, "Member 'M_014_Specification_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_76' has a wrong offset!");
static_assert(offsetof(M_014_Specification_BP::FAnimBlueprintGeneratedConstantData, __StructProperty_77) == 0x000040, "Member 'M_014_Specification_BP::FAnimBlueprintGeneratedConstantData::__StructProperty_77' has a wrong offset!");
static_assert(offsetof(M_014_Specification_BP::FAnimBlueprintGeneratedConstantData, __BoolProperty_78) == 0x000060, "Member 'M_014_Specification_BP::FAnimBlueprintGeneratedConstantData::__BoolProperty_78' has a wrong offset!");
static_assert(offsetof(M_014_Specification_BP::FAnimBlueprintGeneratedConstantData, __FloatProperty_79) == 0x000064, "Member 'M_014_Specification_BP::FAnimBlueprintGeneratedConstantData::__FloatProperty_79' has a wrong offset!");
static_assert(offsetof(M_014_Specification_BP::FAnimBlueprintGeneratedConstantData, __StructProperty_80) == 0x000068, "Member 'M_014_Specification_BP::FAnimBlueprintGeneratedConstantData::__StructProperty_80' has a wrong offset!");
static_assert(offsetof(M_014_Specification_BP::FAnimBlueprintGeneratedConstantData, __FloatProperty_81) == 0x000094, "Member 'M_014_Specification_BP::FAnimBlueprintGeneratedConstantData::__FloatProperty_81' has a wrong offset!");
static_assert(offsetof(M_014_Specification_BP::FAnimBlueprintGeneratedConstantData, __BoolProperty_82) == 0x000098, "Member 'M_014_Specification_BP::FAnimBlueprintGeneratedConstantData::__BoolProperty_82' has a wrong offset!");
static_assert(offsetof(M_014_Specification_BP::FAnimBlueprintGeneratedConstantData, __EnumProperty_83) == 0x000099, "Member 'M_014_Specification_BP::FAnimBlueprintGeneratedConstantData::__EnumProperty_83' has a wrong offset!");
static_assert(offsetof(M_014_Specification_BP::FAnimBlueprintGeneratedConstantData, __ByteProperty_84) == 0x00009A, "Member 'M_014_Specification_BP::FAnimBlueprintGeneratedConstantData::__ByteProperty_84' has a wrong offset!");
static_assert(offsetof(M_014_Specification_BP::FAnimBlueprintGeneratedConstantData, __NameProperty_85) == 0x00009C, "Member 'M_014_Specification_BP::FAnimBlueprintGeneratedConstantData::__NameProperty_85' has a wrong offset!");
static_assert(offsetof(M_014_Specification_BP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A8, "Member 'M_014_Specification_BP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(M_014_Specification_BP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000128, "Member 'M_014_Specification_BP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct M_014_Specification_BP.M_014_Specification_BP_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct M_014_Specification_BP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_014_Specification_BP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on M_014_Specification_BP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(M_014_Specification_BP::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on M_014_Specification_BP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(M_014_Specification_BP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'M_014_Specification_BP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(M_014_Specification_BP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'M_014_Specification_BP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");

}

