#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_045_SubQuestManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_NpcBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPC_045_SubQuestManager.NPC_045_SubQuestManager_C
// 0x0050 (0x07F0 - 0x07A0)
class ANPC_045_SubQuestManager_C final : public ABP_NpcBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_NPC_045_SubQuestManager_C;          // 0x0798(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_NPC_027_Plane;                                  // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_NPC_027_001;                                    // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MPC_027_StaticMesh;                                // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActorComponent;                               // 0x07C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        CamSequenceForDialogueScene_0;                     // 0x07C8(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ExecuteUbergraph_NPC_045_SubQuestManager(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_045_SubQuestManager_C">();
	}
	static class ANPC_045_SubQuestManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANPC_045_SubQuestManager_C>();
	}
};
static_assert(alignof(ANPC_045_SubQuestManager_C) == 0x000010, "Wrong alignment on ANPC_045_SubQuestManager_C");
static_assert(sizeof(ANPC_045_SubQuestManager_C) == 0x0007F0, "Wrong size on ANPC_045_SubQuestManager_C");
static_assert(offsetof(ANPC_045_SubQuestManager_C, UberGraphFrame_NPC_045_SubQuestManager_C) == 0x000798, "Member 'ANPC_045_SubQuestManager_C::UberGraphFrame_NPC_045_SubQuestManager_C' has a wrong offset!");
static_assert(offsetof(ANPC_045_SubQuestManager_C, NS_NPC_027_Plane) == 0x0007A0, "Member 'ANPC_045_SubQuestManager_C::NS_NPC_027_Plane' has a wrong offset!");
static_assert(offsetof(ANPC_045_SubQuestManager_C, NS_NPC_027_001) == 0x0007A8, "Member 'ANPC_045_SubQuestManager_C::NS_NPC_027_001' has a wrong offset!");
static_assert(offsetof(ANPC_045_SubQuestManager_C, MPC_027_StaticMesh) == 0x0007B0, "Member 'ANPC_045_SubQuestManager_C::MPC_027_StaticMesh' has a wrong offset!");
static_assert(offsetof(ANPC_045_SubQuestManager_C, Sphere) == 0x0007B8, "Member 'ANPC_045_SubQuestManager_C::Sphere' has a wrong offset!");
static_assert(offsetof(ANPC_045_SubQuestManager_C, ChildActorComponent) == 0x0007C0, "Member 'ANPC_045_SubQuestManager_C::ChildActorComponent' has a wrong offset!");
static_assert(offsetof(ANPC_045_SubQuestManager_C, CamSequenceForDialogueScene_0) == 0x0007C8, "Member 'ANPC_045_SubQuestManager_C::CamSequenceForDialogueScene_0' has a wrong offset!");

}

