#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_005_PortalDevice

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_NpcBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPC_005_PortalDevice.NPC_005_PortalDevice_C
// 0x0040 (0x07E0 - 0x07A0)
class ANPC_005_PortalDevice_C final : public ABP_NpcBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_NPC_005_PortalDevice_C;             // 0x0798(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_NPC_005_01_Screen;                              // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_NPC_005_01;                                     // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActorComponent;                               // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        CamSequenceForDialogueScene_0;                     // 0x07C0(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ExecuteUbergraph_NPC_005_PortalDevice(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_005_PortalDevice_C">();
	}
	static class ANPC_005_PortalDevice_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANPC_005_PortalDevice_C>();
	}
};
static_assert(alignof(ANPC_005_PortalDevice_C) == 0x000010, "Wrong alignment on ANPC_005_PortalDevice_C");
static_assert(sizeof(ANPC_005_PortalDevice_C) == 0x0007E0, "Wrong size on ANPC_005_PortalDevice_C");
static_assert(offsetof(ANPC_005_PortalDevice_C, UberGraphFrame_NPC_005_PortalDevice_C) == 0x000798, "Member 'ANPC_005_PortalDevice_C::UberGraphFrame_NPC_005_PortalDevice_C' has a wrong offset!");
static_assert(offsetof(ANPC_005_PortalDevice_C, NS_NPC_005_01_Screen) == 0x0007A0, "Member 'ANPC_005_PortalDevice_C::NS_NPC_005_01_Screen' has a wrong offset!");
static_assert(offsetof(ANPC_005_PortalDevice_C, NS_NPC_005_01) == 0x0007A8, "Member 'ANPC_005_PortalDevice_C::NS_NPC_005_01' has a wrong offset!");
static_assert(offsetof(ANPC_005_PortalDevice_C, Sphere) == 0x0007B0, "Member 'ANPC_005_PortalDevice_C::Sphere' has a wrong offset!");
static_assert(offsetof(ANPC_005_PortalDevice_C, ChildActorComponent) == 0x0007B8, "Member 'ANPC_005_PortalDevice_C::ChildActorComponent' has a wrong offset!");
static_assert(offsetof(ANPC_005_PortalDevice_C, CamSequenceForDialogueScene_0) == 0x0007C0, "Member 'ANPC_005_PortalDevice_C::CamSequenceForDialogueScene_0' has a wrong offset!");

}

