#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_Sharen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_PlayerNpcBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPC_Sharen.NPC_Sharen_C
// 0x0020 (0x0880 - 0x0860)
class ANPC_Sharen_C final : public ABP_PlayerNpcBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0860(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UM1ClientOnlySkeletalMeshComponent*     CharacterMesh1;                                    // 0x0868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActorComponent;                               // 0x0870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ExecuteUbergraph_NPC_Sharen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_Sharen_C">();
	}
	static class ANPC_Sharen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANPC_Sharen_C>();
	}
};
static_assert(alignof(ANPC_Sharen_C) == 0x000010, "Wrong alignment on ANPC_Sharen_C");
static_assert(sizeof(ANPC_Sharen_C) == 0x000880, "Wrong size on ANPC_Sharen_C");
static_assert(offsetof(ANPC_Sharen_C, UberGraphFrame) == 0x000860, "Member 'ANPC_Sharen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ANPC_Sharen_C, CharacterMesh1) == 0x000868, "Member 'ANPC_Sharen_C::CharacterMesh1' has a wrong offset!");
static_assert(offsetof(ANPC_Sharen_C, ChildActorComponent) == 0x000870, "Member 'ANPC_Sharen_C::ChildActorComponent' has a wrong offset!");

}

