#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_022_A101_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct NPC_022_A101_AnimBP.NPC_022_A101_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x00D7 (0x00D8 - 0x0001)
struct NPC_022_A101_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_38;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_39;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_40;                                 // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_41;                               // 0x0020(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0040(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00C0(0x0018)()
};
static_assert(alignof(NPC_022_A101_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on NPC_022_A101_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(NPC_022_A101_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0000D8, "Wrong size on NPC_022_A101_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(NPC_022_A101_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_38) == 0x000004, "Member 'NPC_022_A101_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_38' has a wrong offset!");
static_assert(offsetof(NPC_022_A101_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_39) == 0x00000C, "Member 'NPC_022_A101_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_39' has a wrong offset!");
static_assert(offsetof(NPC_022_A101_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_40) == 0x000014, "Member 'NPC_022_A101_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_40' has a wrong offset!");
static_assert(offsetof(NPC_022_A101_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_41) == 0x000020, "Member 'NPC_022_A101_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_41' has a wrong offset!");
static_assert(offsetof(NPC_022_A101_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000040, "Member 'NPC_022_A101_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(NPC_022_A101_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000C0, "Member 'NPC_022_A101_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

