#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_016_PrimeHandsTerminal

#include "Basic.hpp"

#include "BP_NpcBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPC_016_PrimeHandsTerminal.NPC_016_PrimeHandsTerminal_C
// 0x0020 (0x07C0 - 0x07A0)
class ANPC_016_PrimeHandsTerminal_C final : public ABP_NpcBase_C
{
public:
	class UNiagaraComponent*                      NS_NPC_016_PrimeHands_Screen;                      // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   ChildActorComponent;                               // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Albion_PrimeHands_TerminalFloor_CSW;            // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Albion_PrimeHands_Terminal_CSW;                 // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_016_PrimeHandsTerminal_C">();
	}
	static class ANPC_016_PrimeHandsTerminal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANPC_016_PrimeHandsTerminal_C>();
	}
};
static_assert(alignof(ANPC_016_PrimeHandsTerminal_C) == 0x000010, "Wrong alignment on ANPC_016_PrimeHandsTerminal_C");
static_assert(sizeof(ANPC_016_PrimeHandsTerminal_C) == 0x0007C0, "Wrong size on ANPC_016_PrimeHandsTerminal_C");
static_assert(offsetof(ANPC_016_PrimeHandsTerminal_C, NS_NPC_016_PrimeHands_Screen) == 0x000798, "Member 'ANPC_016_PrimeHandsTerminal_C::NS_NPC_016_PrimeHands_Screen' has a wrong offset!");
static_assert(offsetof(ANPC_016_PrimeHandsTerminal_C, ChildActorComponent) == 0x0007A0, "Member 'ANPC_016_PrimeHandsTerminal_C::ChildActorComponent' has a wrong offset!");
static_assert(offsetof(ANPC_016_PrimeHandsTerminal_C, SM_Albion_PrimeHands_TerminalFloor_CSW) == 0x0007A8, "Member 'ANPC_016_PrimeHandsTerminal_C::SM_Albion_PrimeHands_TerminalFloor_CSW' has a wrong offset!");
static_assert(offsetof(ANPC_016_PrimeHandsTerminal_C, SM_Albion_PrimeHands_Terminal_CSW) == 0x0007B0, "Member 'ANPC_016_PrimeHandsTerminal_C::SM_Albion_PrimeHands_Terminal_CSW' has a wrong offset!");

}

