#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_043_A101_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass NPC_043_A101_AnimBP.NPC_043_A101_AnimBP_C
// 0x0640 (0x0960 - 0x0320)
class UNPC_043_A101_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0328(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0330(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0338(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0358(0x00C8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0420(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x0440(0x0280)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x06C0(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x06E0(0x0280)()

public:
	void ExecuteUbergraph_NPC_043_A101_AnimBP(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_043_A101_AnimBP_C">();
	}
	static class UNPC_043_A101_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPC_043_A101_AnimBP_C>();
	}
};
static_assert(alignof(UNPC_043_A101_AnimBP_C) == 0x000010, "Wrong alignment on UNPC_043_A101_AnimBP_C");
static_assert(sizeof(UNPC_043_A101_AnimBP_C) == 0x000960, "Wrong size on UNPC_043_A101_AnimBP_C");
static_assert(offsetof(UNPC_043_A101_AnimBP_C, UberGraphFrame) == 0x000320, "Member 'UNPC_043_A101_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNPC_043_A101_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000328, "Member 'UNPC_043_A101_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UNPC_043_A101_AnimBP_C, AnimBlueprintExtension_Base) == 0x000330, "Member 'UNPC_043_A101_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UNPC_043_A101_AnimBP_C, AnimGraphNode_Root) == 0x000338, "Member 'UNPC_043_A101_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UNPC_043_A101_AnimBP_C, AnimGraphNode_LinkedInputPose) == 0x000358, "Member 'UNPC_043_A101_AnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UNPC_043_A101_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000420, "Member 'UNPC_043_A101_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UNPC_043_A101_AnimBP_C, AnimGraphNode_KawaiiPhysics_1) == 0x000440, "Member 'UNPC_043_A101_AnimBP_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UNPC_043_A101_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x0006C0, "Member 'UNPC_043_A101_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UNPC_043_A101_AnimBP_C, AnimGraphNode_KawaiiPhysics) == 0x0006E0, "Member 'UNPC_043_A101_AnimBP_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");

}

