#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_048_A101_AnimBP

#include "Basic.hpp"

#include "M1AnimPhys_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass NPC_048_A101_AnimBP.NPC_048_A101_AnimBP_C
// 0x1BC0 (0x1EE0 - 0x0320)
class UNPC_048_A101_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0328(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0330(0x0008)()
	uint8                                         Pad_338[0x8];                                      // 0x0338(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_6;                        // 0x0340(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_5;                        // 0x0710(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_4;                        // 0x0AE0(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_3;                        // 0x0EB0(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_2;                        // 0x1280(0x03D0)()
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys_1;                        // 0x1650(0x03D0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1A20(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1AE8(0x0020)()
	uint8                                         Pad_1B08[0x8];                                     // 0x1B08(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AnimNode_AnimPhys                   M1AnimGraphNode_AnimPhys;                          // 0x1B10(0x03D0)()

public:
	void ExecuteUbergraph_NPC_048_A101_AnimBP(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_048_A101_AnimBP_C">();
	}
	static class UNPC_048_A101_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPC_048_A101_AnimBP_C>();
	}
};
static_assert(alignof(UNPC_048_A101_AnimBP_C) == 0x000010, "Wrong alignment on UNPC_048_A101_AnimBP_C");
static_assert(sizeof(UNPC_048_A101_AnimBP_C) == 0x001EE0, "Wrong size on UNPC_048_A101_AnimBP_C");
static_assert(offsetof(UNPC_048_A101_AnimBP_C, UberGraphFrame) == 0x000320, "Member 'UNPC_048_A101_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNPC_048_A101_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000328, "Member 'UNPC_048_A101_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UNPC_048_A101_AnimBP_C, AnimBlueprintExtension_Base) == 0x000330, "Member 'UNPC_048_A101_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UNPC_048_A101_AnimBP_C, M1AnimGraphNode_AnimPhys_6) == 0x000340, "Member 'UNPC_048_A101_AnimBP_C::M1AnimGraphNode_AnimPhys_6' has a wrong offset!");
static_assert(offsetof(UNPC_048_A101_AnimBP_C, M1AnimGraphNode_AnimPhys_5) == 0x000710, "Member 'UNPC_048_A101_AnimBP_C::M1AnimGraphNode_AnimPhys_5' has a wrong offset!");
static_assert(offsetof(UNPC_048_A101_AnimBP_C, M1AnimGraphNode_AnimPhys_4) == 0x000AE0, "Member 'UNPC_048_A101_AnimBP_C::M1AnimGraphNode_AnimPhys_4' has a wrong offset!");
static_assert(offsetof(UNPC_048_A101_AnimBP_C, M1AnimGraphNode_AnimPhys_3) == 0x000EB0, "Member 'UNPC_048_A101_AnimBP_C::M1AnimGraphNode_AnimPhys_3' has a wrong offset!");
static_assert(offsetof(UNPC_048_A101_AnimBP_C, M1AnimGraphNode_AnimPhys_2) == 0x001280, "Member 'UNPC_048_A101_AnimBP_C::M1AnimGraphNode_AnimPhys_2' has a wrong offset!");
static_assert(offsetof(UNPC_048_A101_AnimBP_C, M1AnimGraphNode_AnimPhys_1) == 0x001650, "Member 'UNPC_048_A101_AnimBP_C::M1AnimGraphNode_AnimPhys_1' has a wrong offset!");
static_assert(offsetof(UNPC_048_A101_AnimBP_C, AnimGraphNode_LinkedInputPose) == 0x001A20, "Member 'UNPC_048_A101_AnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UNPC_048_A101_AnimBP_C, AnimGraphNode_Root) == 0x001AE8, "Member 'UNPC_048_A101_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UNPC_048_A101_AnimBP_C, M1AnimGraphNode_AnimPhys) == 0x001B10, "Member 'UNPC_048_A101_AnimBP_C::M1AnimGraphNode_AnimPhys' has a wrong offset!");

}

