#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerkAbility_2_ThunderCage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "M1Data_structs.hpp"
#include "PerkAbilityBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PerkAbility_2_ThunderCage.PerkAbility_2_ThunderCage_C
// 0x0020 (0x02E8 - 0x02C8)
class UPerkAbility_2_ThunderCage_C final : public UPerkAbilityBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_PerkAbility_2_ThunderCage_C;        // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        DamageChance;                                      // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Radius;                                            // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FM1ScaledInteger                       WeaponDamage;                                      // 0x02E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void ExecuteUbergraph_PerkAbility_2_ThunderCage(int32 EntryPoint);
	void MakeDamageFxParam(struct FM1FXParam* M1FXParam);
	void OnEvent_21E73C724FB6B451418F938FB3312CF6(const struct FM1CalcDamageInfo& DamageInfo);
	void TryAOEDamageChance(bool* bReturn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PerkAbility_2_ThunderCage_C">();
	}
	static class UPerkAbility_2_ThunderCage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPerkAbility_2_ThunderCage_C>();
	}
};
static_assert(alignof(UPerkAbility_2_ThunderCage_C) == 0x000008, "Wrong alignment on UPerkAbility_2_ThunderCage_C");
static_assert(sizeof(UPerkAbility_2_ThunderCage_C) == 0x0002E8, "Wrong size on UPerkAbility_2_ThunderCage_C");
static_assert(offsetof(UPerkAbility_2_ThunderCage_C, UberGraphFrame_PerkAbility_2_ThunderCage_C) == 0x0002C8, "Member 'UPerkAbility_2_ThunderCage_C::UberGraphFrame_PerkAbility_2_ThunderCage_C' has a wrong offset!");
static_assert(offsetof(UPerkAbility_2_ThunderCage_C, DamageChance) == 0x0002D0, "Member 'UPerkAbility_2_ThunderCage_C::DamageChance' has a wrong offset!");
static_assert(offsetof(UPerkAbility_2_ThunderCage_C, Radius) == 0x0002D8, "Member 'UPerkAbility_2_ThunderCage_C::Radius' has a wrong offset!");
static_assert(offsetof(UPerkAbility_2_ThunderCage_C, WeaponDamage) == 0x0002E0, "Member 'UPerkAbility_2_ThunderCage_C::WeaponDamage' has a wrong offset!");

}

