#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerkAbility_HitBase

#include "Basic.hpp"

#include "M1_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PerkAbility_HitBase.PerkAbility_HitBase_C.CanAppendDamageCalcMods
// 0x0010 (0x0010 - 0x0000)
struct PerkAbility_HitBase_C_CanAppendDamageCalcMods final
{
public:
	class AActor*                                 HitActor;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Return_value;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerkAbility_HitBase_C_CanAppendDamageCalcMods) == 0x000008, "Wrong alignment on PerkAbility_HitBase_C_CanAppendDamageCalcMods");
static_assert(sizeof(PerkAbility_HitBase_C_CanAppendDamageCalcMods) == 0x000010, "Wrong size on PerkAbility_HitBase_C_CanAppendDamageCalcMods");
static_assert(offsetof(PerkAbility_HitBase_C_CanAppendDamageCalcMods, HitActor) == 0x000000, "Member 'PerkAbility_HitBase_C_CanAppendDamageCalcMods::HitActor' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_CanAppendDamageCalcMods, Return_value) == 0x000008, "Member 'PerkAbility_HitBase_C_CanAppendDamageCalcMods::Return_value' has a wrong offset!");

// Function PerkAbility_HitBase.PerkAbility_HitBase_C.ExecuteUbergraph_PerkAbility_HitBase
// 0x05F0 (0x05F0 - 0x0000)
struct PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1CalcDamageInfo                      K2Node_CustomEvent_DamageInfo;                     // 0x0008(0x0138)(ContainsInstancedReference)
	struct FM1AbilityEvent                        Temp_struct_Variable;                              // 0x0140(0x0040)()
	class UM1AbilityTask_WaitAbilityEvent*        CallFunc_WaitAbilityEvent_ReturnValue;             // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FM1AbilityEventData_DamageCalculation  CallFunc_GetAbilityEventData_DamageCalculation_ReturnValue; // 0x0188(0x00E0)(ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x026B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Time;                      // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0274(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x028C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAppendDamageCalcMods_Return_Value;     // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FM1CalcDamageInfo& DamageInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x02F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1CalcDamageInfo                      K2Node_CustomEvent_DamageInfo_1;                   // 0x0310(0x0138)(ConstParm, ContainsInstancedReference)
	struct FM1CalcDamageInfo                      Temp_struct_Variable_1;                            // 0x0448(0x0138)(ContainsInstancedReference)
	class UM1AbilityTask_WaitDamageEvent*         CallFunc_WaitGiveDamageEvent_ReturnValue;          // 0x0580(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_589[0x7];                                      // 0x0589(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue;                // 0x0590(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FM1AbilityEvent& Event)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0598(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x05A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AA[0x6];                                      // 0x05AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AbilityEvent                        K2Node_CustomEvent_Event;                          // 0x05B0(0x0040)(ConstParm)
};
static_assert(alignof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase) == 0x000008, "Wrong alignment on PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase");
static_assert(sizeof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase) == 0x0005F0, "Wrong size on PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, EntryPoint) == 0x000000, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, K2Node_CustomEvent_DamageInfo) == 0x000008, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::K2Node_CustomEvent_DamageInfo' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, Temp_struct_Variable) == 0x000140, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_WaitAbilityEvent_ReturnValue) == 0x000180, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_WaitAbilityEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_GetAbilityEventData_DamageCalculation_ReturnValue) == 0x000188, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_GetAbilityEventData_DamageCalculation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_IsValid_ReturnValue) == 0x000268, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_HasTag_ReturnValue) == 0x000269, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_BreakHitResult_bBlockingHit) == 0x00026A, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_BreakHitResult_bInitialOverlap) == 0x00026B, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_BreakHitResult_Time) == 0x00026C, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_BreakHitResult_Distance) == 0x000270, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_BreakHitResult_Location) == 0x000274, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_BreakHitResult_ImpactPoint) == 0x000280, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_BreakHitResult_Normal) == 0x00028C, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_BreakHitResult_ImpactNormal) == 0x000298, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_BreakHitResult_PhysMat) == 0x0002A8, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_BreakHitResult_HitActor) == 0x0002B0, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_BreakHitResult_HitComponent) == 0x0002B8, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_BreakHitResult_HitBoneName) == 0x0002C0, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_BreakHitResult_BoneName) == 0x0002C8, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_BreakHitResult_HitItem) == 0x0002D0, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_BreakHitResult_ElementIndex) == 0x0002D4, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_BreakHitResult_FaceIndex) == 0x0002D8, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_BreakHitResult_TraceStart) == 0x0002DC, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_BreakHitResult_TraceEnd) == 0x0002E8, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_CanAppendDamageCalcMods_Return_Value) == 0x0002F4, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_CanAppendDamageCalcMods_Return_Value' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, K2Node_CreateDelegate_OutputDelegate) == 0x0002F8, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_BooleanAND_ReturnValue) == 0x000308, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, K2Node_CustomEvent_DamageInfo_1) == 0x000310, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::K2Node_CustomEvent_DamageInfo_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, Temp_struct_Variable_1) == 0x000448, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_WaitGiveDamageEvent_ReturnValue) == 0x000580, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_WaitGiveDamageEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_IsValid_ReturnValue_1) == 0x000588, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_GetOwnerActor_ReturnValue) == 0x000590, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_GetOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x000598, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_IsValid_ReturnValue_2) == 0x0005A8, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, CallFunc_HasAuthority_ReturnValue) == 0x0005A9, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase, K2Node_CustomEvent_Event) == 0x0005B0, "Member 'PerkAbility_HitBase_C_ExecuteUbergraph_PerkAbility_HitBase::K2Node_CustomEvent_Event' has a wrong offset!");

// Function PerkAbility_HitBase.PerkAbility_HitBase_C.OnAbilityEvent_E6DFDE1447B7AF75A19BD9868EAC6685
// 0x0040 (0x0040 - 0x0000)
struct PerkAbility_HitBase_C_OnAbilityEvent_E6DFDE1447B7AF75A19BD9868EAC6685 final
{
public:
	struct FM1AbilityEvent                        Event;                                             // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PerkAbility_HitBase_C_OnAbilityEvent_E6DFDE1447B7AF75A19BD9868EAC6685) == 0x000008, "Wrong alignment on PerkAbility_HitBase_C_OnAbilityEvent_E6DFDE1447B7AF75A19BD9868EAC6685");
static_assert(sizeof(PerkAbility_HitBase_C_OnAbilityEvent_E6DFDE1447B7AF75A19BD9868EAC6685) == 0x000040, "Wrong size on PerkAbility_HitBase_C_OnAbilityEvent_E6DFDE1447B7AF75A19BD9868EAC6685");
static_assert(offsetof(PerkAbility_HitBase_C_OnAbilityEvent_E6DFDE1447B7AF75A19BD9868EAC6685, Event) == 0x000000, "Member 'PerkAbility_HitBase_C_OnAbilityEvent_E6DFDE1447B7AF75A19BD9868EAC6685::Event' has a wrong offset!");

// Function PerkAbility_HitBase.PerkAbility_HitBase_C.OnEvent_BF53B0AF418AAD9BF0A3B9B71668CE1C
// 0x0138 (0x0138 - 0x0000)
struct PerkAbility_HitBase_C_OnEvent_BF53B0AF418AAD9BF0A3B9B71668CE1C final
{
public:
	struct FM1CalcDamageInfo                      DamageInfo;                                        // 0x0000(0x0138)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(PerkAbility_HitBase_C_OnEvent_BF53B0AF418AAD9BF0A3B9B71668CE1C) == 0x000008, "Wrong alignment on PerkAbility_HitBase_C_OnEvent_BF53B0AF418AAD9BF0A3B9B71668CE1C");
static_assert(sizeof(PerkAbility_HitBase_C_OnEvent_BF53B0AF418AAD9BF0A3B9B71668CE1C) == 0x000138, "Wrong size on PerkAbility_HitBase_C_OnEvent_BF53B0AF418AAD9BF0A3B9B71668CE1C");
static_assert(offsetof(PerkAbility_HitBase_C_OnEvent_BF53B0AF418AAD9BF0A3B9B71668CE1C, DamageInfo) == 0x000000, "Member 'PerkAbility_HitBase_C_OnEvent_BF53B0AF418AAD9BF0A3B9B71668CE1C::DamageInfo' has a wrong offset!");

// Function PerkAbility_HitBase.PerkAbility_HitBase_C.OnGiveDamageToByWeapon
// 0x0138 (0x0138 - 0x0000)
struct PerkAbility_HitBase_C_OnGiveDamageToByWeapon final
{
public:
	struct FM1CalcDamageInfo                      DamageInfo;                                        // 0x0000(0x0138)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
};
static_assert(alignof(PerkAbility_HitBase_C_OnGiveDamageToByWeapon) == 0x000008, "Wrong alignment on PerkAbility_HitBase_C_OnGiveDamageToByWeapon");
static_assert(sizeof(PerkAbility_HitBase_C_OnGiveDamageToByWeapon) == 0x000138, "Wrong size on PerkAbility_HitBase_C_OnGiveDamageToByWeapon");
static_assert(offsetof(PerkAbility_HitBase_C_OnGiveDamageToByWeapon, DamageInfo) == 0x000000, "Member 'PerkAbility_HitBase_C_OnGiveDamageToByWeapon::DamageInfo' has a wrong offset!");

}

