#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerkAbility_4_DivinePunishment

#include "Basic.hpp"

#include "M1_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "PerkAbilityBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PerkAbility_4_DivinePunishment.PerkAbility_4_DivinePunishment_C
// 0x0078 (0x0340 - 0x02C8)
class UPerkAbility_4_DivinePunishment_C final : public UPerkAbilityBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_PerkAbility_4_DivinePunishment_C;   // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<struct FGameplayTag, class FName>        VfxBoolParamNameMap;                               // 0x02D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UNiagaraComponent*>              BuffFXs;                                           // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FM1AbilityId>                   SEIds;                                             // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BP_OnActivated();
	void ExecuteUbergraph_PerkAbility_4_DivinePunishment(int32 EntryPoint);
	void OnAbilityEvent_546B5C984F288B98E44199BA65A1E934(const struct FM1AbilityEvent& Event);
	void OnAddedSE(const class UM1StatusEffect* StatusEffect);
	void OnRemovedSE(const class UM1StatusEffect* StatusEffect);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PerkAbility_4_DivinePunishment_C">();
	}
	static class UPerkAbility_4_DivinePunishment_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPerkAbility_4_DivinePunishment_C>();
	}
};
static_assert(alignof(UPerkAbility_4_DivinePunishment_C) == 0x000008, "Wrong alignment on UPerkAbility_4_DivinePunishment_C");
static_assert(sizeof(UPerkAbility_4_DivinePunishment_C) == 0x000340, "Wrong size on UPerkAbility_4_DivinePunishment_C");
static_assert(offsetof(UPerkAbility_4_DivinePunishment_C, UberGraphFrame_PerkAbility_4_DivinePunishment_C) == 0x0002C8, "Member 'UPerkAbility_4_DivinePunishment_C::UberGraphFrame_PerkAbility_4_DivinePunishment_C' has a wrong offset!");
static_assert(offsetof(UPerkAbility_4_DivinePunishment_C, VfxBoolParamNameMap) == 0x0002D0, "Member 'UPerkAbility_4_DivinePunishment_C::VfxBoolParamNameMap' has a wrong offset!");
static_assert(offsetof(UPerkAbility_4_DivinePunishment_C, BuffFXs) == 0x000320, "Member 'UPerkAbility_4_DivinePunishment_C::BuffFXs' has a wrong offset!");
static_assert(offsetof(UPerkAbility_4_DivinePunishment_C, SEIds) == 0x000330, "Member 'UPerkAbility_4_DivinePunishment_C::SEIds' has a wrong offset!");

}

