#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerkAbility_5_GregsReversedFate

#include "Basic.hpp"

#include "M1_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "M1Data_structs.hpp"


namespace SDK::Params
{

// Function PerkAbility_5_GregsReversedFate.PerkAbility_5_GregsReversedFate_C.ExecuteUbergraph_PerkAbility_5_GregsReversedFate
// 0x05C0 (0x05C0 - 0x0000)
struct PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AbilityEvent                        K2Node_CustomEvent_Event;                          // 0x0008(0x0040)(ConstParm)
	struct FM1CalcDamageInfo                      K2Node_CustomEvent_DamageInfo;                     // 0x0048(0x0138)(ConstParm, ContainsInstancedReference)
	TDelegate<void(struct FM1CalcDamageInfo& DamageInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0180(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FM1CalcDamageInfo                      Temp_struct_Variable;                              // 0x0190(0x0138)(ContainsInstancedReference)
	class UM1AbilityTask_WaitDamageEvent*         CallFunc_WaitGiveDamageEvent_ReturnValue;          // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_ScaledIntToString_ReturnValue;       // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EA[0x2];                                      // 0x02EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0318(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0338(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x035C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0368(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AbilityParamData                    K2Node_MakeStruct_M1AbilityParamData;              // 0x0378(0x0020)()
	TArray<struct FM1AbilityParamData>            K2Node_MakeArray_Array;                            // 0x0398(0x0010)(ReferenceParm)
	TDelegate<void(struct FM1AbilityEvent& Event)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x03A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FM1TaggedAbilityParamData              K2Node_MakeStruct_M1TaggedAbilityParamData;        // 0x03B8(0x0018)()
	struct FM1TaggedAbilityParamData              K2Node_MakeStruct_M1TaggedAbilityParamData_1;      // 0x03D0(0x0018)()
	double                                        CallFunc_RandomFloat_ReturnValue;                  // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FM1TaggedAbilityParamData>      K2Node_MakeArray_Array_1;                          // 0x03F0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0402(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_403[0xD];                                      // 0x0403(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0410(0x0030)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue;                // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Temp_name_Variable;                                // 0x0448(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AbilityContextHandle                CallFunc_BP_MakeForwardingContext_ReturnValue;     // 0x0460(0x0010)()
	class AM1AbilityActor*                        CallFunc_SpawnFirstAbilityActorByTag_ReturnValue;  // 0x0470(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UM1AbilityTask_WaitAbilityEvent*        CallFunc_WaitAbilityEvent_ReturnValue;             // 0x0480(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AbilityEvent                        Temp_struct_Variable_1;                            // 0x0490(0x0040)()
	struct FM1AbilityEventData_DamageCalculation  CallFunc_GetAbilityEventData_DamageCalculation_ReturnValue; // 0x04D0(0x00E0)(ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate) == 0x000010, "Wrong alignment on PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate");
static_assert(sizeof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate) == 0x0005C0, "Wrong size on PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, EntryPoint) == 0x000000, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::EntryPoint' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, K2Node_CustomEvent_Event) == 0x000008, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::K2Node_CustomEvent_Event' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, K2Node_CustomEvent_DamageInfo) == 0x000048, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::K2Node_CustomEvent_DamageInfo' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, K2Node_CreateDelegate_OutputDelegate) == 0x000180, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, Temp_struct_Variable) == 0x000190, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_WaitGiveDamageEvent_ReturnValue) == 0x0002C8, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_WaitGiveDamageEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_IsValid_ReturnValue) == 0x0002D0, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0002D1, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_Conv_ScaledIntToString_ReturnValue) == 0x0002D8, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_Conv_ScaledIntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_BreakHitResult_bBlockingHit) == 0x0002E8, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_BreakHitResult_bInitialOverlap) == 0x0002E9, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_BreakHitResult_Time) == 0x0002EC, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_BreakHitResult_Distance) == 0x0002F0, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_BreakHitResult_Location) == 0x0002F4, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_BreakHitResult_ImpactPoint) == 0x000300, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_BreakHitResult_Normal) == 0x00030C, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_BreakHitResult_ImpactNormal) == 0x000318, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_BreakHitResult_PhysMat) == 0x000328, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_BreakHitResult_HitActor) == 0x000330, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_BreakHitResult_HitComponent) == 0x000338, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_BreakHitResult_HitBoneName) == 0x000340, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_BreakHitResult_BoneName) == 0x000348, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_BreakHitResult_HitItem) == 0x000350, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_BreakHitResult_ElementIndex) == 0x000354, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_BreakHitResult_FaceIndex) == 0x000358, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_BreakHitResult_TraceStart) == 0x00035C, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_BreakHitResult_TraceEnd) == 0x000368, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, K2Node_MakeStruct_M1AbilityParamData) == 0x000378, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::K2Node_MakeStruct_M1AbilityParamData' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, K2Node_MakeArray_Array) == 0x000398, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, K2Node_CreateDelegate_OutputDelegate_1) == 0x0003A8, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, K2Node_MakeStruct_M1TaggedAbilityParamData) == 0x0003B8, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::K2Node_MakeStruct_M1TaggedAbilityParamData' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, K2Node_MakeStruct_M1TaggedAbilityParamData_1) == 0x0003D0, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::K2Node_MakeStruct_M1TaggedAbilityParamData_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_RandomFloat_ReturnValue) == 0x0003E8, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, K2Node_MakeArray_Array_1) == 0x0003F0, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000400, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000401, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_BooleanAND_ReturnValue) == 0x000402, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_GetTransform_ReturnValue) == 0x000410, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_GetOwnerActor_ReturnValue) == 0x000440, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_GetOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, Temp_name_Variable) == 0x000448, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_IsValid_ReturnValue_1) == 0x000458, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_BP_MakeForwardingContext_ReturnValue) == 0x000460, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_BP_MakeForwardingContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_SpawnFirstAbilityActorByTag_ReturnValue) == 0x000470, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_SpawnFirstAbilityActorByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_HasAuthority_ReturnValue) == 0x000478, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_WaitAbilityEvent_ReturnValue) == 0x000480, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_WaitAbilityEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_IsValid_ReturnValue_2) == 0x000488, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, Temp_struct_Variable_1) == 0x000490, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_GetAbilityEventData_DamageCalculation_ReturnValue) == 0x0004D0, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_GetAbilityEventData_DamageCalculation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0005B0, "Member 'PerkAbility_5_GregsReversedFate_C_ExecuteUbergraph_PerkAbility_5_GregsReversedFate::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function PerkAbility_5_GregsReversedFate.PerkAbility_5_GregsReversedFate_C.OnAbilityEvent_A4AF1C234C2ABC0B47BAECBC0EB89862
// 0x0040 (0x0040 - 0x0000)
struct PerkAbility_5_GregsReversedFate_C_OnAbilityEvent_A4AF1C234C2ABC0B47BAECBC0EB89862 final
{
public:
	struct FM1AbilityEvent                        Event;                                             // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PerkAbility_5_GregsReversedFate_C_OnAbilityEvent_A4AF1C234C2ABC0B47BAECBC0EB89862) == 0x000008, "Wrong alignment on PerkAbility_5_GregsReversedFate_C_OnAbilityEvent_A4AF1C234C2ABC0B47BAECBC0EB89862");
static_assert(sizeof(PerkAbility_5_GregsReversedFate_C_OnAbilityEvent_A4AF1C234C2ABC0B47BAECBC0EB89862) == 0x000040, "Wrong size on PerkAbility_5_GregsReversedFate_C_OnAbilityEvent_A4AF1C234C2ABC0B47BAECBC0EB89862");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_OnAbilityEvent_A4AF1C234C2ABC0B47BAECBC0EB89862, Event) == 0x000000, "Member 'PerkAbility_5_GregsReversedFate_C_OnAbilityEvent_A4AF1C234C2ABC0B47BAECBC0EB89862::Event' has a wrong offset!");

// Function PerkAbility_5_GregsReversedFate.PerkAbility_5_GregsReversedFate_C.OnEvent_CA9FEB6E49AA70D866B7E187F933698F
// 0x0138 (0x0138 - 0x0000)
struct PerkAbility_5_GregsReversedFate_C_OnEvent_CA9FEB6E49AA70D866B7E187F933698F final
{
public:
	struct FM1CalcDamageInfo                      DamageInfo;                                        // 0x0000(0x0138)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(PerkAbility_5_GregsReversedFate_C_OnEvent_CA9FEB6E49AA70D866B7E187F933698F) == 0x000008, "Wrong alignment on PerkAbility_5_GregsReversedFate_C_OnEvent_CA9FEB6E49AA70D866B7E187F933698F");
static_assert(sizeof(PerkAbility_5_GregsReversedFate_C_OnEvent_CA9FEB6E49AA70D866B7E187F933698F) == 0x000138, "Wrong size on PerkAbility_5_GregsReversedFate_C_OnEvent_CA9FEB6E49AA70D866B7E187F933698F");
static_assert(offsetof(PerkAbility_5_GregsReversedFate_C_OnEvent_CA9FEB6E49AA70D866B7E187F933698F, DamageInfo) == 0x000000, "Member 'PerkAbility_5_GregsReversedFate_C_OnEvent_CA9FEB6E49AA70D866B7E187F933698F::DamageInfo' has a wrong offset!");

}

