#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerkAbility_5_GregsReversedFate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PerkAbilityBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PerkAbility_5_GregsReversedFate.PerkAbility_5_GregsReversedFate_C
// 0x0020 (0x02E8 - 0x02C8)
class UPerkAbility_5_GregsReversedFate_C final : public UPerkAbilityBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_PerkAbility_5_GregsReversedFate_C;  // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        DamageChance;                                      // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMaxShieldTargetActor;                            // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void ExecuteUbergraph_PerkAbility_5_GregsReversedFate(int32 EntryPoint);
	void OnAbilityEvent_A4AF1C234C2ABC0B47BAECBC0EB89862(const struct FM1AbilityEvent& Event);
	void OnEvent_CA9FEB6E49AA70D866B7E187F933698F(const struct FM1CalcDamageInfo& DamageInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PerkAbility_5_GregsReversedFate_C">();
	}
	static class UPerkAbility_5_GregsReversedFate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPerkAbility_5_GregsReversedFate_C>();
	}
};
static_assert(alignof(UPerkAbility_5_GregsReversedFate_C) == 0x000008, "Wrong alignment on UPerkAbility_5_GregsReversedFate_C");
static_assert(sizeof(UPerkAbility_5_GregsReversedFate_C) == 0x0002E8, "Wrong size on UPerkAbility_5_GregsReversedFate_C");
static_assert(offsetof(UPerkAbility_5_GregsReversedFate_C, UberGraphFrame_PerkAbility_5_GregsReversedFate_C) == 0x0002C8, "Member 'UPerkAbility_5_GregsReversedFate_C::UberGraphFrame_PerkAbility_5_GregsReversedFate_C' has a wrong offset!");
static_assert(offsetof(UPerkAbility_5_GregsReversedFate_C, DamageChance) == 0x0002D0, "Member 'UPerkAbility_5_GregsReversedFate_C::DamageChance' has a wrong offset!");
static_assert(offsetof(UPerkAbility_5_GregsReversedFate_C, TargetActor) == 0x0002D8, "Member 'UPerkAbility_5_GregsReversedFate_C::TargetActor' has a wrong offset!");
static_assert(offsetof(UPerkAbility_5_GregsReversedFate_C, IsMaxShieldTargetActor) == 0x0002E0, "Member 'UPerkAbility_5_GregsReversedFate_C::IsMaxShieldTargetActor' has a wrong offset!");

}

