#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerkAbility_8_BlueBeetle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PerkAbilityBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PerkAbility_8_BlueBeetle.PerkAbility_8_BlueBeetle_C
// 0x0018 (0x02E0 - 0x02C8)
class UPerkAbility_8_BlueBeetle_C final : public UPerkAbilityBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_PerkAbility_8_BlueBeetle_C;         // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        FusionChance;                                      // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SingularChance;                                    // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void ExecuteUbergraph_PerkAbility_8_BlueBeetle(int32 EntryPoint);
	void OnAbilityEvent_03ED67594A6AE8BA33C9369987B2A3C9(const struct FM1AbilityEvent& Event);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PerkAbility_8_BlueBeetle_C">();
	}
	static class UPerkAbility_8_BlueBeetle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPerkAbility_8_BlueBeetle_C>();
	}
};
static_assert(alignof(UPerkAbility_8_BlueBeetle_C) == 0x000008, "Wrong alignment on UPerkAbility_8_BlueBeetle_C");
static_assert(sizeof(UPerkAbility_8_BlueBeetle_C) == 0x0002E0, "Wrong size on UPerkAbility_8_BlueBeetle_C");
static_assert(offsetof(UPerkAbility_8_BlueBeetle_C, UberGraphFrame_PerkAbility_8_BlueBeetle_C) == 0x0002C8, "Member 'UPerkAbility_8_BlueBeetle_C::UberGraphFrame_PerkAbility_8_BlueBeetle_C' has a wrong offset!");
static_assert(offsetof(UPerkAbility_8_BlueBeetle_C, FusionChance) == 0x0002D0, "Member 'UPerkAbility_8_BlueBeetle_C::FusionChance' has a wrong offset!");
static_assert(offsetof(UPerkAbility_8_BlueBeetle_C, SingularChance) == 0x0002D8, "Member 'UPerkAbility_8_BlueBeetle_C::SingularChance' has a wrong offset!");

}

