#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerkAbility_3_GreatLegacy

#include "Basic.hpp"

#include "M1_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function PerkAbility_3_GreatLegacy.PerkAbility_3_GreatLegacy_C.ExecuteUbergraph_PerkAbility_3_GreatLegacy
// 0x04C8 (0x04C8 - 0x0000)
struct PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AbilityEvent                        K2Node_CustomEvent_Event;                          // 0x0008(0x0040)(ConstParm)
	struct FM1AbilityEvent                        Temp_struct_Variable;                              // 0x0048(0x0040)()
	class UM1AbilityTask_WaitAbilityEvent*        CallFunc_WaitAbilityEvent_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AbilityEventData_DamageCalculation  CallFunc_GetAbilityEventData_DamageCalculation_ReturnValue; // 0x0098(0x00E0)(ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FM1CalcDamageInfo& DamageInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x017C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1CalcDamageInfo                      K2Node_CustomEvent_DamageInfo;                     // 0x0190(0x0138)(ConstParm, ContainsInstancedReference)
	struct FM1CalcDamageInfo                      Temp_struct_Variable_1;                            // 0x02C8(0x0138)(ContainsInstancedReference)
	class UM1AbilityTask_WaitDamageEvent*         CallFunc_WaitGiveDamageEvent_ReturnValue;          // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x040A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x040B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Time;                      // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0414(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0420(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x042C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0438(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0448(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0450(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0458(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x047C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0488(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_494[0x4];                                      // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AbilityId                           CallFunc_InvokeFirstStatusEffectToTargetByTag_ReturnValue; // 0x0498(0x0010)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue;                // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x04B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B2[0x2];                                      // 0x04B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FM1AbilityEvent& Event)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x04B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveStatusEffectIdTag_ReturnValue;    // 0x04C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy) == 0x000008, "Wrong alignment on PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy");
static_assert(sizeof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy) == 0x0004C8, "Wrong size on PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, EntryPoint) == 0x000000, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::EntryPoint' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, K2Node_CustomEvent_Event) == 0x000008, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::K2Node_CustomEvent_Event' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, Temp_struct_Variable) == 0x000048, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_WaitAbilityEvent_ReturnValue) == 0x000088, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_WaitAbilityEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_GetAbilityEventData_DamageCalculation_ReturnValue) == 0x000098, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_GetAbilityEventData_DamageCalculation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000178, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, K2Node_CreateDelegate_OutputDelegate) == 0x00017C, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, K2Node_CustomEvent_DamageInfo) == 0x000190, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::K2Node_CustomEvent_DamageInfo' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, Temp_struct_Variable_1) == 0x0002C8, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_WaitGiveDamageEvent_ReturnValue) == 0x000400, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_WaitGiveDamageEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_IsValid_ReturnValue_1) == 0x000408, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000409, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_BreakHitResult_bBlockingHit) == 0x00040A, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_BreakHitResult_bInitialOverlap) == 0x00040B, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_BreakHitResult_Time) == 0x00040C, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_BreakHitResult_Distance) == 0x000410, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_BreakHitResult_Location) == 0x000414, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_BreakHitResult_ImpactPoint) == 0x000420, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_BreakHitResult_Normal) == 0x00042C, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_BreakHitResult_ImpactNormal) == 0x000438, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_BreakHitResult_PhysMat) == 0x000448, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_BreakHitResult_HitActor) == 0x000450, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_BreakHitResult_HitComponent) == 0x000458, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_BreakHitResult_HitBoneName) == 0x000460, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_BreakHitResult_BoneName) == 0x000468, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_BreakHitResult_HitItem) == 0x000470, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_BreakHitResult_ElementIndex) == 0x000474, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_BreakHitResult_FaceIndex) == 0x000478, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_BreakHitResult_TraceStart) == 0x00047C, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_BreakHitResult_TraceEnd) == 0x000488, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_InvokeFirstStatusEffectToTargetByTag_ReturnValue) == 0x000498, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_InvokeFirstStatusEffectToTargetByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_GetOwnerActor_ReturnValue) == 0x0004A8, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_GetOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_IsValid_ReturnValue_2) == 0x0004B0, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_HasAuthority_ReturnValue) == 0x0004B1, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, K2Node_CreateDelegate_OutputDelegate_1) == 0x0004B4, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy, CallFunc_IsActiveStatusEffectIdTag_ReturnValue) == 0x0004C4, "Member 'PerkAbility_3_GreatLegacy_C_ExecuteUbergraph_PerkAbility_3_GreatLegacy::CallFunc_IsActiveStatusEffectIdTag_ReturnValue' has a wrong offset!");

// Function PerkAbility_3_GreatLegacy.PerkAbility_3_GreatLegacy_C.OnAbilityEvent_81077A4E43FE1CFCBC39DD89463BAD78
// 0x0040 (0x0040 - 0x0000)
struct PerkAbility_3_GreatLegacy_C_OnAbilityEvent_81077A4E43FE1CFCBC39DD89463BAD78 final
{
public:
	struct FM1AbilityEvent                        Event;                                             // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PerkAbility_3_GreatLegacy_C_OnAbilityEvent_81077A4E43FE1CFCBC39DD89463BAD78) == 0x000008, "Wrong alignment on PerkAbility_3_GreatLegacy_C_OnAbilityEvent_81077A4E43FE1CFCBC39DD89463BAD78");
static_assert(sizeof(PerkAbility_3_GreatLegacy_C_OnAbilityEvent_81077A4E43FE1CFCBC39DD89463BAD78) == 0x000040, "Wrong size on PerkAbility_3_GreatLegacy_C_OnAbilityEvent_81077A4E43FE1CFCBC39DD89463BAD78");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_OnAbilityEvent_81077A4E43FE1CFCBC39DD89463BAD78, Event) == 0x000000, "Member 'PerkAbility_3_GreatLegacy_C_OnAbilityEvent_81077A4E43FE1CFCBC39DD89463BAD78::Event' has a wrong offset!");

// Function PerkAbility_3_GreatLegacy.PerkAbility_3_GreatLegacy_C.OnEvent_FF8D19174F054E56080CDBB2055AEF7A
// 0x0138 (0x0138 - 0x0000)
struct PerkAbility_3_GreatLegacy_C_OnEvent_FF8D19174F054E56080CDBB2055AEF7A final
{
public:
	struct FM1CalcDamageInfo                      DamageInfo;                                        // 0x0000(0x0138)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(PerkAbility_3_GreatLegacy_C_OnEvent_FF8D19174F054E56080CDBB2055AEF7A) == 0x000008, "Wrong alignment on PerkAbility_3_GreatLegacy_C_OnEvent_FF8D19174F054E56080CDBB2055AEF7A");
static_assert(sizeof(PerkAbility_3_GreatLegacy_C_OnEvent_FF8D19174F054E56080CDBB2055AEF7A) == 0x000138, "Wrong size on PerkAbility_3_GreatLegacy_C_OnEvent_FF8D19174F054E56080CDBB2055AEF7A");
static_assert(offsetof(PerkAbility_3_GreatLegacy_C_OnEvent_FF8D19174F054E56080CDBB2055AEF7A, DamageInfo) == 0x000000, "Member 'PerkAbility_3_GreatLegacy_C_OnEvent_FF8D19174F054E56080CDBB2055AEF7A::DamageInfo' has a wrong offset!");

}

