#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerkAbility_7_NazestrasDevotion

#include "Basic.hpp"

#include "M1_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function PerkAbility_7_NazestrasDevotion.PerkAbility_7_NazestrasDevotion_C.ExecuteUbergraph_PerkAbility_7_NazestrasDevotion
// 0x03E8 (0x03E8 - 0x0000)
struct PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AbilityEvent                        K2Node_CustomEvent_Event;                          // 0x0008(0x0040)(ConstParm)
	struct FM1AbilityEvent                        Temp_struct_Variable;                              // 0x0048(0x0040)()
	class UM1AbilityTask_WaitAbilityEvent*        CallFunc_WaitAbilityEvent_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0094(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FM1CalcDamageInfo& DamageInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMatchedActorByFindTargetQueryTag_ReturnValue; // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1CalcDamageInfo                      K2Node_CustomEvent_DamageInfo;                     // 0x00B0(0x0138)(ConstParm, ContainsInstancedReference)
	struct FM1CalcDamageInfo                      Temp_struct_Variable_2;                            // 0x01E8(0x0138)(ContainsInstancedReference)
	class UM1AbilityTask_WaitDamageEvent*         CallFunc_WaitGiveDamageEvent_ReturnValue;          // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x032A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x032B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Time;                      // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0334(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0340(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x034C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0378(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x039C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x03A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AbilityId                           CallFunc_InvokeFirstStatusEffectToTargetByTag_ReturnValue; // 0x03B8(0x0010)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue;                // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D2[0x2];                                      // 0x03D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FM1AbilityEvent& Event)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x03D4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_TryExecuteCostOperation_ReturnValue;   // 0x03E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion) == 0x000008, "Wrong alignment on PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion");
static_assert(sizeof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion) == 0x0003E8, "Wrong size on PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, EntryPoint) == 0x000000, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::EntryPoint' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, K2Node_CustomEvent_Event) == 0x000008, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::K2Node_CustomEvent_Event' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, Temp_struct_Variable) == 0x000048, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_WaitAbilityEvent_ReturnValue) == 0x000088, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_WaitAbilityEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, Temp_struct_Variable_1) == 0x000094, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, K2Node_CreateDelegate_OutputDelegate) == 0x00009C, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_IsMatchedActorByFindTargetQueryTag_ReturnValue) == 0x0000AC, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_IsMatchedActorByFindTargetQueryTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, K2Node_CustomEvent_DamageInfo) == 0x0000B0, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::K2Node_CustomEvent_DamageInfo' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, Temp_struct_Variable_2) == 0x0001E8, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_WaitGiveDamageEvent_ReturnValue) == 0x000320, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_WaitGiveDamageEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_IsValid_ReturnValue_1) == 0x000328, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000329, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_BreakHitResult_bBlockingHit) == 0x00032A, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_BreakHitResult_bInitialOverlap) == 0x00032B, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_BreakHitResult_Time) == 0x00032C, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_BreakHitResult_Distance) == 0x000330, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_BreakHitResult_Location) == 0x000334, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_BreakHitResult_ImpactPoint) == 0x000340, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_BreakHitResult_Normal) == 0x00034C, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_BreakHitResult_ImpactNormal) == 0x000358, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_BreakHitResult_PhysMat) == 0x000368, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_BreakHitResult_HitActor) == 0x000370, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_BreakHitResult_HitComponent) == 0x000378, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_BreakHitResult_HitBoneName) == 0x000380, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_BreakHitResult_BoneName) == 0x000388, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_BreakHitResult_HitItem) == 0x000390, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_BreakHitResult_ElementIndex) == 0x000394, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_BreakHitResult_FaceIndex) == 0x000398, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_BreakHitResult_TraceStart) == 0x00039C, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_BreakHitResult_TraceEnd) == 0x0003A8, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_BooleanAND_ReturnValue) == 0x0003B4, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_InvokeFirstStatusEffectToTargetByTag_ReturnValue) == 0x0003B8, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_InvokeFirstStatusEffectToTargetByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_GetOwnerActor_ReturnValue) == 0x0003C8, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_GetOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_IsValid_ReturnValue_2) == 0x0003D0, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_HasAuthority_ReturnValue) == 0x0003D1, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, K2Node_CreateDelegate_OutputDelegate_1) == 0x0003D4, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion, CallFunc_BP_TryExecuteCostOperation_ReturnValue) == 0x0003E4, "Member 'PerkAbility_7_NazestrasDevotion_C_ExecuteUbergraph_PerkAbility_7_NazestrasDevotion::CallFunc_BP_TryExecuteCostOperation_ReturnValue' has a wrong offset!");

// Function PerkAbility_7_NazestrasDevotion.PerkAbility_7_NazestrasDevotion_C.OnAbilityEvent_DB23546B4B75BDEDCCAD38986FFB649E
// 0x0040 (0x0040 - 0x0000)
struct PerkAbility_7_NazestrasDevotion_C_OnAbilityEvent_DB23546B4B75BDEDCCAD38986FFB649E final
{
public:
	struct FM1AbilityEvent                        Event;                                             // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PerkAbility_7_NazestrasDevotion_C_OnAbilityEvent_DB23546B4B75BDEDCCAD38986FFB649E) == 0x000008, "Wrong alignment on PerkAbility_7_NazestrasDevotion_C_OnAbilityEvent_DB23546B4B75BDEDCCAD38986FFB649E");
static_assert(sizeof(PerkAbility_7_NazestrasDevotion_C_OnAbilityEvent_DB23546B4B75BDEDCCAD38986FFB649E) == 0x000040, "Wrong size on PerkAbility_7_NazestrasDevotion_C_OnAbilityEvent_DB23546B4B75BDEDCCAD38986FFB649E");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_OnAbilityEvent_DB23546B4B75BDEDCCAD38986FFB649E, Event) == 0x000000, "Member 'PerkAbility_7_NazestrasDevotion_C_OnAbilityEvent_DB23546B4B75BDEDCCAD38986FFB649E::Event' has a wrong offset!");

// Function PerkAbility_7_NazestrasDevotion.PerkAbility_7_NazestrasDevotion_C.OnEvent_99BD73234FC3B7231488379A1429A84E
// 0x0138 (0x0138 - 0x0000)
struct PerkAbility_7_NazestrasDevotion_C_OnEvent_99BD73234FC3B7231488379A1429A84E final
{
public:
	struct FM1CalcDamageInfo                      DamageInfo;                                        // 0x0000(0x0138)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(PerkAbility_7_NazestrasDevotion_C_OnEvent_99BD73234FC3B7231488379A1429A84E) == 0x000008, "Wrong alignment on PerkAbility_7_NazestrasDevotion_C_OnEvent_99BD73234FC3B7231488379A1429A84E");
static_assert(sizeof(PerkAbility_7_NazestrasDevotion_C_OnEvent_99BD73234FC3B7231488379A1429A84E) == 0x000138, "Wrong size on PerkAbility_7_NazestrasDevotion_C_OnEvent_99BD73234FC3B7231488379A1429A84E");
static_assert(offsetof(PerkAbility_7_NazestrasDevotion_C_OnEvent_99BD73234FC3B7231488379A1429A84E, DamageInfo) == 0x000000, "Member 'PerkAbility_7_NazestrasDevotion_C_OnEvent_99BD73234FC3B7231488379A1429A84E::DamageInfo' has a wrong offset!");

}

