#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerkAbility_8_BlueBeetle

#include "Basic.hpp"

#include "M1_structs.hpp"


namespace SDK::Params
{

// Function PerkAbility_8_BlueBeetle.PerkAbility_8_BlueBeetle_C.ExecuteUbergraph_PerkAbility_8_BlueBeetle
// 0x00F0 (0x00F0 - 0x0000)
struct PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AbilityEvent                        Temp_struct_Variable;                              // 0x0008(0x0040)()
	TDelegate<void(struct FM1AbilityEvent& Event)> K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTraitTagFromSkillCommitedEvent_ReturnValue; // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTraitTagFromSkillCommitedEvent_ReturnValue_1; // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UM1AbilityTask_WaitAbilityEvent*        CallFunc_WaitAbilityEvent_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloat_ReturnValue;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FM1AbilityEvent                        K2Node_CustomEvent_Event;                          // 0x0080(0x0040)(ConstParm)
	double                                        CallFunc_RandomFloat_ReturnValue_1;                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AbilityId                           CallFunc_InvokeFirstStatusEffectToSelfByTag_ReturnValue; // 0x00D0(0x0010)(HasGetValueTypeHash)
	struct FM1AbilityId                           CallFunc_InvokeFirstStatusEffectToSelfByTag_ReturnValue_1; // 0x00E0(0x0010)(HasGetValueTypeHash)
};
static_assert(alignof(PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle) == 0x000008, "Wrong alignment on PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle");
static_assert(sizeof(PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle) == 0x0000F0, "Wrong size on PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle");
static_assert(offsetof(PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle, EntryPoint) == 0x000000, "Member 'PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle::EntryPoint' has a wrong offset!");
static_assert(offsetof(PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle, Temp_struct_Variable) == 0x000008, "Member 'PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle, CallFunc_HasTraitTagFromSkillCommitedEvent_ReturnValue) == 0x000058, "Member 'PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle::CallFunc_HasTraitTagFromSkillCommitedEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle, CallFunc_HasTraitTagFromSkillCommitedEvent_ReturnValue_1) == 0x000059, "Member 'PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle::CallFunc_HasTraitTagFromSkillCommitedEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle, CallFunc_WaitAbilityEvent_ReturnValue) == 0x000060, "Member 'PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle::CallFunc_WaitAbilityEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle, CallFunc_GetOwnerActor_ReturnValue) == 0x000068, "Member 'PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle::CallFunc_GetOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle, CallFunc_HasAuthority_ReturnValue) == 0x000071, "Member 'PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle, CallFunc_IsValid_ReturnValue_1) == 0x000072, "Member 'PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle, CallFunc_RandomFloat_ReturnValue) == 0x000078, "Member 'PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle, K2Node_CustomEvent_Event) == 0x000080, "Member 'PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle::K2Node_CustomEvent_Event' has a wrong offset!");
static_assert(offsetof(PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle, CallFunc_RandomFloat_ReturnValue_1) == 0x0000C0, "Member 'PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle::CallFunc_RandomFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x0000C9, "Member 'PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle, CallFunc_InvokeFirstStatusEffectToSelfByTag_ReturnValue) == 0x0000D0, "Member 'PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle::CallFunc_InvokeFirstStatusEffectToSelfByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle, CallFunc_InvokeFirstStatusEffectToSelfByTag_ReturnValue_1) == 0x0000E0, "Member 'PerkAbility_8_BlueBeetle_C_ExecuteUbergraph_PerkAbility_8_BlueBeetle::CallFunc_InvokeFirstStatusEffectToSelfByTag_ReturnValue_1' has a wrong offset!");

// Function PerkAbility_8_BlueBeetle.PerkAbility_8_BlueBeetle_C.OnAbilityEvent_03ED67594A6AE8BA33C9369987B2A3C9
// 0x0040 (0x0040 - 0x0000)
struct PerkAbility_8_BlueBeetle_C_OnAbilityEvent_03ED67594A6AE8BA33C9369987B2A3C9 final
{
public:
	struct FM1AbilityEvent                        Event;                                             // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PerkAbility_8_BlueBeetle_C_OnAbilityEvent_03ED67594A6AE8BA33C9369987B2A3C9) == 0x000008, "Wrong alignment on PerkAbility_8_BlueBeetle_C_OnAbilityEvent_03ED67594A6AE8BA33C9369987B2A3C9");
static_assert(sizeof(PerkAbility_8_BlueBeetle_C_OnAbilityEvent_03ED67594A6AE8BA33C9369987B2A3C9) == 0x000040, "Wrong size on PerkAbility_8_BlueBeetle_C_OnAbilityEvent_03ED67594A6AE8BA33C9369987B2A3C9");
static_assert(offsetof(PerkAbility_8_BlueBeetle_C_OnAbilityEvent_03ED67594A6AE8BA33C9369987B2A3C9, Event) == 0x000000, "Member 'PerkAbility_8_BlueBeetle_C_OnAbilityEvent_03ED67594A6AE8BA33C9369987B2A3C9::Event' has a wrong offset!");

}

