#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PerkAbility_4_DivinePunishment

#include "Basic.hpp"

#include "M1_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "M1Data_structs.hpp"


namespace SDK::Params
{

// Function PerkAbility_4_DivinePunishment.PerkAbility_4_DivinePunishment_C.ExecuteUbergraph_PerkAbility_4_DivinePunishment
// 0x0138 (0x0138 - 0x0000)
struct PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AbilityEvent                        K2Node_CustomEvent_Event;                          // 0x0008(0x0040)(ConstParm)
	struct FM1AbilityEvent                        Temp_struct_Variable;                              // 0x0048(0x0040)()
	class UM1AbilityTask_WaitAbilityEvent*        CallFunc_WaitAbilityEvent_ReturnValue;             // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UM1AbilityEventObject_StatusEffectGrant* K2Node_DynamicCast_AsM1Ability_Event_Object_Status_Effect_Grant; // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_1;                 // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_2;                 // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesTag_ReturnValue_3;                 // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FM1AbilityEvent& Event)> K2Node_CreateDelegate_OutputDelegate;              // 0x00B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AbilityId                           CallFunc_InvokeFirstStatusEffectToSelfByTag_ReturnValue; // 0x00C8(0x0010)(HasGetValueTypeHash)
	struct FM1AbilityId                           CallFunc_InvokeFirstStatusEffectToSelfByTag_ReturnValue_1; // 0x00D8(0x0010)(HasGetValueTypeHash)
	struct FM1AbilityId                           CallFunc_InvokeFirstStatusEffectToSelfByTag_ReturnValue_2; // 0x00E8(0x0010)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwnerActor_ReturnValue_1;              // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UM1StatusEffect* StatusEffect)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AM1Character*                           K2Node_DynamicCast_AsM1Character;                  // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UM1StatusEffect* StatusEffect)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x011C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UM1StatusEffectComponent*               CallFunc_GetStatusEffectComponent_ReturnValue;     // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment) == 0x000008, "Wrong alignment on PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment");
static_assert(sizeof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment) == 0x000138, "Wrong size on PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, EntryPoint) == 0x000000, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::EntryPoint' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, K2Node_CustomEvent_Event) == 0x000008, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::K2Node_CustomEvent_Event' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, Temp_struct_Variable) == 0x000048, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, CallFunc_WaitAbilityEvent_ReturnValue) == 0x000088, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::CallFunc_WaitAbilityEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, K2Node_DynamicCast_AsM1Ability_Event_Object_Status_Effect_Grant) == 0x000098, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::K2Node_DynamicCast_AsM1Ability_Event_Object_Status_Effect_Grant' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, CallFunc_MatchesTag_ReturnValue) == 0x0000A1, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, CallFunc_MatchesTag_ReturnValue_1) == 0x0000A2, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::CallFunc_MatchesTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, CallFunc_MatchesTag_ReturnValue_2) == 0x0000A3, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::CallFunc_MatchesTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, CallFunc_MatchesTag_ReturnValue_3) == 0x0000A4, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::CallFunc_MatchesTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x0000A5, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, CallFunc_GetOwnerActor_ReturnValue) == 0x0000A8, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::CallFunc_GetOwnerActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, CallFunc_IsValid_ReturnValue_1) == 0x0000B0, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, K2Node_CreateDelegate_OutputDelegate) == 0x0000B4, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, CallFunc_HasAuthority_ReturnValue) == 0x0000C4, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, CallFunc_InvokeFirstStatusEffectToSelfByTag_ReturnValue) == 0x0000C8, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::CallFunc_InvokeFirstStatusEffectToSelfByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, CallFunc_InvokeFirstStatusEffectToSelfByTag_ReturnValue_1) == 0x0000D8, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::CallFunc_InvokeFirstStatusEffectToSelfByTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, CallFunc_InvokeFirstStatusEffectToSelfByTag_ReturnValue_2) == 0x0000E8, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::CallFunc_InvokeFirstStatusEffectToSelfByTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, CallFunc_GetOwnerActor_ReturnValue_1) == 0x0000F8, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::CallFunc_GetOwnerActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, K2Node_CreateDelegate_OutputDelegate_1) == 0x000100, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, K2Node_DynamicCast_AsM1Character) == 0x000110, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::K2Node_DynamicCast_AsM1Character' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, K2Node_DynamicCast_bSuccess_1) == 0x000118, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, K2Node_CreateDelegate_OutputDelegate_2) == 0x00011C, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment, CallFunc_GetStatusEffectComponent_ReturnValue) == 0x000130, "Member 'PerkAbility_4_DivinePunishment_C_ExecuteUbergraph_PerkAbility_4_DivinePunishment::CallFunc_GetStatusEffectComponent_ReturnValue' has a wrong offset!");

// Function PerkAbility_4_DivinePunishment.PerkAbility_4_DivinePunishment_C.OnAbilityEvent_546B5C984F288B98E44199BA65A1E934
// 0x0040 (0x0040 - 0x0000)
struct PerkAbility_4_DivinePunishment_C_OnAbilityEvent_546B5C984F288B98E44199BA65A1E934 final
{
public:
	struct FM1AbilityEvent                        Event;                                             // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PerkAbility_4_DivinePunishment_C_OnAbilityEvent_546B5C984F288B98E44199BA65A1E934) == 0x000008, "Wrong alignment on PerkAbility_4_DivinePunishment_C_OnAbilityEvent_546B5C984F288B98E44199BA65A1E934");
static_assert(sizeof(PerkAbility_4_DivinePunishment_C_OnAbilityEvent_546B5C984F288B98E44199BA65A1E934) == 0x000040, "Wrong size on PerkAbility_4_DivinePunishment_C_OnAbilityEvent_546B5C984F288B98E44199BA65A1E934");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnAbilityEvent_546B5C984F288B98E44199BA65A1E934, Event) == 0x000000, "Member 'PerkAbility_4_DivinePunishment_C_OnAbilityEvent_546B5C984F288B98E44199BA65A1E934::Event' has a wrong offset!");

// Function PerkAbility_4_DivinePunishment.PerkAbility_4_DivinePunishment_C.OnAddedSE
// 0x0178 (0x0178 - 0x0000)
struct PerkAbility_4_DivinePunishment_C_OnAddedSE final
{
public:
	const class UM1StatusEffect*                  StatusEffect;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   ParamName;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           IdTag;                                             // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AbilityId                           CallFunc_GetAbilityId_ReturnValue;                 // 0x0028(0x0010)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNiagaraComponent*>              CallFunc_SpawnFXsForAbility_ReturnValue;           // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1StatusEffectData                    CallFunc_GetStatusEffectData_ReturnValue;          // 0x0060(0x0108)(ConstParm)
	class FName                                   CallFunc_Map_Find_Value;                           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerkAbility_4_DivinePunishment_C_OnAddedSE) == 0x000008, "Wrong alignment on PerkAbility_4_DivinePunishment_C_OnAddedSE");
static_assert(sizeof(PerkAbility_4_DivinePunishment_C_OnAddedSE) == 0x000178, "Wrong size on PerkAbility_4_DivinePunishment_C_OnAddedSE");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnAddedSE, StatusEffect) == 0x000000, "Member 'PerkAbility_4_DivinePunishment_C_OnAddedSE::StatusEffect' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnAddedSE, ParamName) == 0x000008, "Member 'PerkAbility_4_DivinePunishment_C_OnAddedSE::ParamName' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnAddedSE, IdTag) == 0x000010, "Member 'PerkAbility_4_DivinePunishment_C_OnAddedSE::IdTag' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnAddedSE, Temp_int_Array_Index_Variable) == 0x000018, "Member 'PerkAbility_4_DivinePunishment_C_OnAddedSE::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnAddedSE, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'PerkAbility_4_DivinePunishment_C_OnAddedSE::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnAddedSE, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'PerkAbility_4_DivinePunishment_C_OnAddedSE::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnAddedSE, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000024, "Member 'PerkAbility_4_DivinePunishment_C_OnAddedSE::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnAddedSE, CallFunc_GetAbilityId_ReturnValue) == 0x000028, "Member 'PerkAbility_4_DivinePunishment_C_OnAddedSE::CallFunc_GetAbilityId_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnAddedSE, CallFunc_Array_AddUnique_ReturnValue) == 0x000038, "Member 'PerkAbility_4_DivinePunishment_C_OnAddedSE::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnAddedSE, CallFunc_SpawnFXsForAbility_ReturnValue) == 0x000040, "Member 'PerkAbility_4_DivinePunishment_C_OnAddedSE::CallFunc_SpawnFXsForAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnAddedSE, CallFunc_Array_Get_Item) == 0x000050, "Member 'PerkAbility_4_DivinePunishment_C_OnAddedSE::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnAddedSE, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'PerkAbility_4_DivinePunishment_C_OnAddedSE::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnAddedSE, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'PerkAbility_4_DivinePunishment_C_OnAddedSE::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnAddedSE, CallFunc_GetStatusEffectData_ReturnValue) == 0x000060, "Member 'PerkAbility_4_DivinePunishment_C_OnAddedSE::CallFunc_GetStatusEffectData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnAddedSE, CallFunc_Map_Find_Value) == 0x000168, "Member 'PerkAbility_4_DivinePunishment_C_OnAddedSE::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnAddedSE, CallFunc_Map_Find_ReturnValue) == 0x000170, "Member 'PerkAbility_4_DivinePunishment_C_OnAddedSE::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function PerkAbility_4_DivinePunishment.PerkAbility_4_DivinePunishment_C.OnRemovedSE
// 0x0160 (0x0160 - 0x0000)
struct PerkAbility_4_DivinePunishment_C_OnRemovedSE final
{
public:
	const class UM1StatusEffect*                  StatusEffect;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   ParamName;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1AbilityId                           CallFunc_GetAbilityId_ReturnValue;                 // 0x0020(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FM1StatusEffectData                    CallFunc_GetStatusEffectData_ReturnValue;          // 0x0048(0x0108)(ConstParm)
	class FName                                   CallFunc_Map_Find_Value;                           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PerkAbility_4_DivinePunishment_C_OnRemovedSE) == 0x000008, "Wrong alignment on PerkAbility_4_DivinePunishment_C_OnRemovedSE");
static_assert(sizeof(PerkAbility_4_DivinePunishment_C_OnRemovedSE) == 0x000160, "Wrong size on PerkAbility_4_DivinePunishment_C_OnRemovedSE");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnRemovedSE, StatusEffect) == 0x000000, "Member 'PerkAbility_4_DivinePunishment_C_OnRemovedSE::StatusEffect' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnRemovedSE, ParamName) == 0x000008, "Member 'PerkAbility_4_DivinePunishment_C_OnRemovedSE::ParamName' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnRemovedSE, Temp_int_Array_Index_Variable) == 0x000010, "Member 'PerkAbility_4_DivinePunishment_C_OnRemovedSE::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnRemovedSE, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'PerkAbility_4_DivinePunishment_C_OnRemovedSE::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnRemovedSE, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'PerkAbility_4_DivinePunishment_C_OnRemovedSE::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnRemovedSE, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00001C, "Member 'PerkAbility_4_DivinePunishment_C_OnRemovedSE::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnRemovedSE, CallFunc_GetAbilityId_ReturnValue) == 0x000020, "Member 'PerkAbility_4_DivinePunishment_C_OnRemovedSE::CallFunc_GetAbilityId_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnRemovedSE, CallFunc_Array_RemoveItem_ReturnValue) == 0x000030, "Member 'PerkAbility_4_DivinePunishment_C_OnRemovedSE::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnRemovedSE, CallFunc_Array_Get_Item) == 0x000038, "Member 'PerkAbility_4_DivinePunishment_C_OnRemovedSE::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnRemovedSE, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'PerkAbility_4_DivinePunishment_C_OnRemovedSE::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnRemovedSE, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'PerkAbility_4_DivinePunishment_C_OnRemovedSE::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnRemovedSE, CallFunc_GetStatusEffectData_ReturnValue) == 0x000048, "Member 'PerkAbility_4_DivinePunishment_C_OnRemovedSE::CallFunc_GetStatusEffectData_ReturnValue' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnRemovedSE, CallFunc_Map_Find_Value) == 0x000150, "Member 'PerkAbility_4_DivinePunishment_C_OnRemovedSE::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(PerkAbility_4_DivinePunishment_C_OnRemovedSE, CallFunc_Map_Find_ReturnValue) == 0x000158, "Member 'PerkAbility_4_DivinePunishment_C_OnRemovedSE::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

}

