#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RW_BR_1001_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct RW_BR_1001_AnimBP.RW_BR_1001_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x015F (0x0160 - 0x0001)
struct RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_77;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_78;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_79;                                  // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_80;                                 // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_81;                                  // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_82;                                 // 0x0024(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_83;                                  // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_84;                                 // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_85;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_86;                               // 0x0038(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_87;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_88;                                 // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_89;                                 // 0x0069(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_90;                                 // 0x006C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_91;                                 // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_92;                                  // 0x007C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_93;                               // 0x0080(0x0020)(BlueprintVisible, NoDestructor)
	class UBlendProfile*                          __BlendProfile_94;                                 // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_95;                                   // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_96;                                 // 0x00B0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_97;                                 // 0x00B1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_98;                                 // 0x00B2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_99;                                // 0x00B8(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00C8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0148(0x0018)()
};
static_assert(alignof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000160, "Wrong size on RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_77) == 0x000004, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_77' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_78) == 0x00000C, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_78' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_79) == 0x000014, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_79' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_80) == 0x000018, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_80' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_81) == 0x000020, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_81' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_82) == 0x000024, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_82' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_83) == 0x00002C, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_83' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_84) == 0x000030, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_84' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_85) == 0x000034, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_85' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_86) == 0x000038, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_86' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_87) == 0x000064, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_87' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_88) == 0x000068, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_88' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_89) == 0x000069, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_89' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_90) == 0x00006C, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_90' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_91) == 0x000074, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_91' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_92) == 0x00007C, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_92' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_93) == 0x000080, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_93' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_94) == 0x0000A0, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_94' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_95) == 0x0000A8, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_95' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_96) == 0x0000B0, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_96' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_97) == 0x0000B1, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_97' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_98) == 0x0000B2, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_98' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_99) == 0x0000B8, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_99' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000C8, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000148, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct RW_BR_1001_AnimBP.RW_BR_1001_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct RW_BR_1001_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on RW_BR_1001_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on RW_BR_1001_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(RW_BR_1001_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'RW_BR_1001_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

}

