#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RW_SG_1007_AnimBP

#include "Basic.hpp"

#include "M1_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass RW_SG_1007_AnimBP.RW_SG_1007_AnimBP_C
// 0x0260 (0x0590 - 0x0330)
class URW_SG_1007_AnimBP_C final : public UM1WeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0338(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0340(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0348(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0368(0x01D8)(ContainsInstancedReference)
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0540(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_RW_SG_1007_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RW_SG_1007_AnimBP_C">();
	}
	static class URW_SG_1007_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URW_SG_1007_AnimBP_C>();
	}
};
static_assert(alignof(URW_SG_1007_AnimBP_C) == 0x000010, "Wrong alignment on URW_SG_1007_AnimBP_C");
static_assert(sizeof(URW_SG_1007_AnimBP_C) == 0x000590, "Wrong size on URW_SG_1007_AnimBP_C");
static_assert(offsetof(URW_SG_1007_AnimBP_C, UberGraphFrame) == 0x000330, "Member 'URW_SG_1007_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URW_SG_1007_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000338, "Member 'URW_SG_1007_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(URW_SG_1007_AnimBP_C, AnimBlueprintExtension_Base) == 0x000340, "Member 'URW_SG_1007_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(URW_SG_1007_AnimBP_C, AnimGraphNode_Root) == 0x000348, "Member 'URW_SG_1007_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(URW_SG_1007_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x000368, "Member 'URW_SG_1007_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(URW_SG_1007_AnimBP_C, AnimGraphNode_Slot) == 0x000540, "Member 'URW_SG_1007_AnimBP_C::AnimGraphNode_Slot' has a wrong offset!");

}

