#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ItemIcon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "M1Data_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UI_ItemIcon.UI_ItemIcon_C.UpdateDps
// 0x0028 (0x0028 - 0x0000)
struct UI_ItemIcon_C_UpdateDps final
{
public:
	class UM1UIDataItemInfo*                      InData;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UM1UIDataItemInfo_Equipment*            K2Node_DynamicCast_AsM1UIData_Item_Info_Equipment; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWeapon_ReturnValue;                     // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ItemIcon_C_UpdateDps) == 0x000008, "Wrong alignment on UI_ItemIcon_C_UpdateDps");
static_assert(sizeof(UI_ItemIcon_C_UpdateDps) == 0x000028, "Wrong size on UI_ItemIcon_C_UpdateDps");
static_assert(offsetof(UI_ItemIcon_C_UpdateDps, InData) == 0x000000, "Member 'UI_ItemIcon_C_UpdateDps::InData' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_UpdateDps, Temp_bool_Variable) == 0x000008, "Member 'UI_ItemIcon_C_UpdateDps::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_UpdateDps, K2Node_DynamicCast_AsM1UIData_Item_Info_Equipment) == 0x000010, "Member 'UI_ItemIcon_C_UpdateDps::K2Node_DynamicCast_AsM1UIData_Item_Info_Equipment' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_UpdateDps, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UI_ItemIcon_C_UpdateDps::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_UpdateDps, Temp_byte_Variable) == 0x000019, "Member 'UI_ItemIcon_C_UpdateDps::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_UpdateDps, CallFunc_IsWeapon_ReturnValue) == 0x00001A, "Member 'UI_ItemIcon_C_UpdateDps::CallFunc_IsWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_UpdateDps, Temp_byte_Variable_1) == 0x00001B, "Member 'UI_ItemIcon_C_UpdateDps::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_UpdateDps, CallFunc_Not_PreBool_ReturnValue) == 0x00001C, "Member 'UI_ItemIcon_C_UpdateDps::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_UpdateDps, CallFunc_Not_PreBool_ReturnValue_1) == 0x00001D, "Member 'UI_ItemIcon_C_UpdateDps::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_UpdateDps, CallFunc_BooleanOR_ReturnValue) == 0x00001E, "Member 'UI_ItemIcon_C_UpdateDps::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_UpdateDps, CallFunc_BooleanOR_ReturnValue_1) == 0x00001F, "Member 'UI_ItemIcon_C_UpdateDps::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_UpdateDps, K2Node_Select_Default) == 0x000020, "Member 'UI_ItemIcon_C_UpdateDps::K2Node_Select_Default' has a wrong offset!");

// Function UI_ItemIcon.UI_ItemIcon_C.ShowEquippedIcon
// 0x0020 (0x0020 - 0x0000)
struct UI_ItemIcon_C_ShowEquippedIcon final
{
public:
	class UM1UIDataItemInfo*                      InItemInfo;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UM1UIDataItemInfo_Equipment*            K2Node_DynamicCast_AsM1UIData_Item_Info_Equipment; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEquipped_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ItemIcon_C_ShowEquippedIcon) == 0x000008, "Wrong alignment on UI_ItemIcon_C_ShowEquippedIcon");
static_assert(sizeof(UI_ItemIcon_C_ShowEquippedIcon) == 0x000020, "Wrong size on UI_ItemIcon_C_ShowEquippedIcon");
static_assert(offsetof(UI_ItemIcon_C_ShowEquippedIcon, InItemInfo) == 0x000000, "Member 'UI_ItemIcon_C_ShowEquippedIcon::InItemInfo' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ShowEquippedIcon, Temp_bool_Variable) == 0x000008, "Member 'UI_ItemIcon_C_ShowEquippedIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ShowEquippedIcon, K2Node_DynamicCast_AsM1UIData_Item_Info_Equipment) == 0x000010, "Member 'UI_ItemIcon_C_ShowEquippedIcon::K2Node_DynamicCast_AsM1UIData_Item_Info_Equipment' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ShowEquippedIcon, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UI_ItemIcon_C_ShowEquippedIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ShowEquippedIcon, Temp_byte_Variable) == 0x000019, "Member 'UI_ItemIcon_C_ShowEquippedIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ShowEquippedIcon, CallFunc_IsEquipped_ReturnValue) == 0x00001A, "Member 'UI_ItemIcon_C_ShowEquippedIcon::CallFunc_IsEquipped_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ShowEquippedIcon, Temp_byte_Variable_1) == 0x00001B, "Member 'UI_ItemIcon_C_ShowEquippedIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ShowEquippedIcon, K2Node_Select_Default) == 0x00001C, "Member 'UI_ItemIcon_C_ShowEquippedIcon::K2Node_Select_Default' has a wrong offset!");

// Function UI_ItemIcon.UI_ItemIcon_C.SetUIRandomOptionLocation
// 0x002C (0x002C - 0x0000)
struct UI_ItemIcon_C_SetUIRandomOptionLocation final
{
public:
	int32                                         In_Class;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewLocalVar;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_1;                              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_ItemIcon_C_SetUIRandomOptionLocation) == 0x000004, "Wrong alignment on UI_ItemIcon_C_SetUIRandomOptionLocation");
static_assert(sizeof(UI_ItemIcon_C_SetUIRandomOptionLocation) == 0x00002C, "Wrong size on UI_ItemIcon_C_SetUIRandomOptionLocation");
static_assert(offsetof(UI_ItemIcon_C_SetUIRandomOptionLocation, In_Class) == 0x000000, "Member 'UI_ItemIcon_C_SetUIRandomOptionLocation::In_Class' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetUIRandomOptionLocation, NewLocalVar) == 0x000004, "Member 'UI_ItemIcon_C_SetUIRandomOptionLocation::NewLocalVar' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetUIRandomOptionLocation, Temp_int_Variable) == 0x000008, "Member 'UI_ItemIcon_C_SetUIRandomOptionLocation::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetUIRandomOptionLocation, Temp_real_Variable) == 0x00000C, "Member 'UI_ItemIcon_C_SetUIRandomOptionLocation::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetUIRandomOptionLocation, Temp_real_Variable_1) == 0x000010, "Member 'UI_ItemIcon_C_SetUIRandomOptionLocation::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetUIRandomOptionLocation, Temp_real_Variable_2) == 0x000014, "Member 'UI_ItemIcon_C_SetUIRandomOptionLocation::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetUIRandomOptionLocation, K2Node_Select_Default) == 0x000018, "Member 'UI_ItemIcon_C_SetUIRandomOptionLocation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetUIRandomOptionLocation, K2Node_MakeStruct_Margin) == 0x00001C, "Member 'UI_ItemIcon_C_SetUIRandomOptionLocation::K2Node_MakeStruct_Margin' has a wrong offset!");

// Function UI_ItemIcon.UI_ItemIcon_C.SetUIIconStretch
// 0x0001 (0x0001 - 0x0000)
struct UI_ItemIcon_C_SetUIIconStretch final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ItemIcon_C_SetUIIconStretch) == 0x000001, "Wrong alignment on UI_ItemIcon_C_SetUIIconStretch");
static_assert(sizeof(UI_ItemIcon_C_SetUIIconStretch) == 0x000001, "Wrong size on UI_ItemIcon_C_SetUIIconStretch");
static_assert(offsetof(UI_ItemIcon_C_SetUIIconStretch, NewParam) == 0x000000, "Member 'UI_ItemIcon_C_SetUIIconStretch::NewParam' has a wrong offset!");

// Function UI_ItemIcon.UI_ItemIcon_C.SetRandomOption
// 0x0068 (0x0068 - 0x0000)
struct UI_ItemIcon_C_SetRandomOption final
{
public:
	class UM1UIDataItemInfo*                      InData;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable;                                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UM1UIDataItemInfo_Equipment*            K2Node_DynamicCast_AsM1UIData_Item_Info_Equipment; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EM1EquipmentCategoryType                      CallFunc_GetCategory_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EM1ItemOptionTierType>                 CallFunc_GetRandomOptionTiers_ReturnValue;         // 0x0020(0x0010)(ReferenceParm)
	float                                         Temp_real_Variable_1;                              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_2;                              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_3;                              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_4;                              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_5;                              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_6;                              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_7;                              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_real_Variable_8;                              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EM1EquipmentCategoryType                      Temp_byte_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_ItemIcon_C_SetRandomOption) == 0x000008, "Wrong alignment on UI_ItemIcon_C_SetRandomOption");
static_assert(sizeof(UI_ItemIcon_C_SetRandomOption) == 0x000068, "Wrong size on UI_ItemIcon_C_SetRandomOption");
static_assert(offsetof(UI_ItemIcon_C_SetRandomOption, InData) == 0x000000, "Member 'UI_ItemIcon_C_SetRandomOption::InData' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetRandomOption, Temp_real_Variable) == 0x000008, "Member 'UI_ItemIcon_C_SetRandomOption::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetRandomOption, K2Node_DynamicCast_AsM1UIData_Item_Info_Equipment) == 0x000010, "Member 'UI_ItemIcon_C_SetRandomOption::K2Node_DynamicCast_AsM1UIData_Item_Info_Equipment' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetRandomOption, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UI_ItemIcon_C_SetRandomOption::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetRandomOption, CallFunc_GetCategory_ReturnValue) == 0x000019, "Member 'UI_ItemIcon_C_SetRandomOption::CallFunc_GetCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetRandomOption, CallFunc_GetRandomOptionTiers_ReturnValue) == 0x000020, "Member 'UI_ItemIcon_C_SetRandomOption::CallFunc_GetRandomOptionTiers_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetRandomOption, Temp_real_Variable_1) == 0x000030, "Member 'UI_ItemIcon_C_SetRandomOption::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetRandomOption, Temp_real_Variable_2) == 0x000034, "Member 'UI_ItemIcon_C_SetRandomOption::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetRandomOption, Temp_real_Variable_3) == 0x000038, "Member 'UI_ItemIcon_C_SetRandomOption::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetRandomOption, Temp_real_Variable_4) == 0x00003C, "Member 'UI_ItemIcon_C_SetRandomOption::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetRandomOption, Temp_real_Variable_5) == 0x000040, "Member 'UI_ItemIcon_C_SetRandomOption::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetRandomOption, Temp_real_Variable_6) == 0x000044, "Member 'UI_ItemIcon_C_SetRandomOption::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetRandomOption, Temp_real_Variable_7) == 0x000048, "Member 'UI_ItemIcon_C_SetRandomOption::Temp_real_Variable_7' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetRandomOption, Temp_real_Variable_8) == 0x00004C, "Member 'UI_ItemIcon_C_SetRandomOption::Temp_real_Variable_8' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetRandomOption, Temp_byte_Variable) == 0x000050, "Member 'UI_ItemIcon_C_SetRandomOption::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetRandomOption, K2Node_Select_Default) == 0x000054, "Member 'UI_ItemIcon_C_SetRandomOption::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetRandomOption, K2Node_MakeStruct_Margin) == 0x000058, "Member 'UI_ItemIcon_C_SetRandomOption::K2Node_MakeStruct_Margin' has a wrong offset!");

// Function UI_ItemIcon.UI_ItemIcon_C.SetPerk
// 0x0018 (0x0018 - 0x0000)
struct UI_ItemIcon_C_SetPerk final
{
public:
	class UM1UIDataItemInfo_Equipment*            EquipmentData;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPerkMaxEnchantLevel_ReturnValue;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPerkEnchantLevel_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasPerk_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ItemIcon_C_SetPerk) == 0x000008, "Wrong alignment on UI_ItemIcon_C_SetPerk");
static_assert(sizeof(UI_ItemIcon_C_SetPerk) == 0x000018, "Wrong size on UI_ItemIcon_C_SetPerk");
static_assert(offsetof(UI_ItemIcon_C_SetPerk, EquipmentData) == 0x000000, "Member 'UI_ItemIcon_C_SetPerk::EquipmentData' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetPerk, Temp_byte_Variable) == 0x000008, "Member 'UI_ItemIcon_C_SetPerk::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetPerk, CallFunc_IsPerkMaxEnchantLevel_ReturnValue) == 0x000009, "Member 'UI_ItemIcon_C_SetPerk::CallFunc_IsPerkMaxEnchantLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetPerk, CallFunc_GetPerkEnchantLevel_ReturnValue) == 0x00000C, "Member 'UI_ItemIcon_C_SetPerk::CallFunc_GetPerkEnchantLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetPerk, CallFunc_HasPerk_ReturnValue) == 0x000010, "Member 'UI_ItemIcon_C_SetPerk::CallFunc_HasPerk_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetPerk, Temp_byte_Variable_1) == 0x000011, "Member 'UI_ItemIcon_C_SetPerk::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetPerk, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000012, "Member 'UI_ItemIcon_C_SetPerk::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetPerk, Temp_bool_Variable) == 0x000013, "Member 'UI_ItemIcon_C_SetPerk::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetPerk, CallFunc_BooleanOR_ReturnValue) == 0x000014, "Member 'UI_ItemIcon_C_SetPerk::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetPerk, K2Node_Select_Default) == 0x000015, "Member 'UI_ItemIcon_C_SetPerk::K2Node_Select_Default' has a wrong offset!");

// Function UI_ItemIcon.UI_ItemIcon_C.SetItemStack
// 0x0028 (0x0028 - 0x0000)
struct UI_ItemIcon_C_SetItemStack final
{
public:
	class UM1UIDataItemInfo*                      NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_GetQuantity_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_Int64ToInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ItemIcon_C_SetItemStack) == 0x000008, "Wrong alignment on UI_ItemIcon_C_SetItemStack");
static_assert(sizeof(UI_ItemIcon_C_SetItemStack) == 0x000028, "Wrong size on UI_ItemIcon_C_SetItemStack");
static_assert(offsetof(UI_ItemIcon_C_SetItemStack, NewParam) == 0x000000, "Member 'UI_ItemIcon_C_SetItemStack::NewParam' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetItemStack, Temp_bool_Variable) == 0x000008, "Member 'UI_ItemIcon_C_SetItemStack::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetItemStack, CallFunc_GetQuantity_ReturnValue) == 0x000010, "Member 'UI_ItemIcon_C_SetItemStack::CallFunc_GetQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetItemStack, Temp_byte_Variable) == 0x000018, "Member 'UI_ItemIcon_C_SetItemStack::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetItemStack, CallFunc_Conv_Int64ToInt_ReturnValue) == 0x00001C, "Member 'UI_ItemIcon_C_SetItemStack::CallFunc_Conv_Int64ToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetItemStack, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'UI_ItemIcon_C_SetItemStack::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetItemStack, Temp_byte_Variable_1) == 0x000021, "Member 'UI_ItemIcon_C_SetItemStack::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetItemStack, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'UI_ItemIcon_C_SetItemStack::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetItemStack, CallFunc_BooleanOR_ReturnValue) == 0x000023, "Member 'UI_ItemIcon_C_SetItemStack::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetItemStack, K2Node_Select_Default) == 0x000024, "Member 'UI_ItemIcon_C_SetItemStack::K2Node_Select_Default' has a wrong offset!");

// Function UI_ItemIcon.UI_ItemIcon_C.SetItemLevel
// 0x0018 (0x0018 - 0x0000)
struct UI_ItemIcon_C_SetItemLevel final
{
public:
	class UM1UIDataItemInfo*                      NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ItemIcon_C_SetItemLevel) == 0x000008, "Wrong alignment on UI_ItemIcon_C_SetItemLevel");
static_assert(sizeof(UI_ItemIcon_C_SetItemLevel) == 0x000018, "Wrong size on UI_ItemIcon_C_SetItemLevel");
static_assert(offsetof(UI_ItemIcon_C_SetItemLevel, NewParam) == 0x000000, "Member 'UI_ItemIcon_C_SetItemLevel::NewParam' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetItemLevel, Temp_bool_Variable) == 0x000008, "Member 'UI_ItemIcon_C_SetItemLevel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetItemLevel, CallFunc_GetLevel_ReturnValue) == 0x00000C, "Member 'UI_ItemIcon_C_SetItemLevel::CallFunc_GetLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetItemLevel, Temp_byte_Variable) == 0x000010, "Member 'UI_ItemIcon_C_SetItemLevel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetItemLevel, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000011, "Member 'UI_ItemIcon_C_SetItemLevel::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetItemLevel, Temp_byte_Variable_1) == 0x000012, "Member 'UI_ItemIcon_C_SetItemLevel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetItemLevel, CallFunc_BooleanOR_ReturnValue) == 0x000013, "Member 'UI_ItemIcon_C_SetItemLevel::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_SetItemLevel, K2Node_Select_Default) == 0x000014, "Member 'UI_ItemIcon_C_SetItemLevel::K2Node_Select_Default' has a wrong offset!");

// Function UI_ItemIcon.UI_ItemIcon_C.SetDataImpl
// 0x0008 (0x0008 - 0x0000)
struct UI_ItemIcon_C_SetDataImpl final
{
public:
	class UM1UIData*                              InData;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ItemIcon_C_SetDataImpl) == 0x000008, "Wrong alignment on UI_ItemIcon_C_SetDataImpl");
static_assert(sizeof(UI_ItemIcon_C_SetDataImpl) == 0x000008, "Wrong size on UI_ItemIcon_C_SetDataImpl");
static_assert(offsetof(UI_ItemIcon_C_SetDataImpl, InData) == 0x000000, "Member 'UI_ItemIcon_C_SetDataImpl::InData' has a wrong offset!");

// Function UI_ItemIcon.UI_ItemIcon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_ItemIcon_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ItemIcon_C_PreConstruct) == 0x000001, "Wrong alignment on UI_ItemIcon_C_PreConstruct");
static_assert(sizeof(UI_ItemIcon_C_PreConstruct) == 0x000001, "Wrong size on UI_ItemIcon_C_PreConstruct");
static_assert(offsetof(UI_ItemIcon_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_ItemIcon_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_ItemIcon.UI_ItemIcon_C.ExecuteUbergraph_UI_ItemIcon
// 0x0118 (0x0118 - 0x0000)
struct UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EM1ItemTierType                               Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EM1ElementalDamageChannel                     Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EM1SkillArcheType                             Temp_byte_Variable_9;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_13;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_14;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_15;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UM1UIData*                              K2Node_Event_InData;                               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UM1UIDataItemInfo*                      K2Node_DynamicCast_AsM1UIData_Item_Info;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EM1ItemTierType                               CallFunc_GetItemTier_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Get_UI_TierColor_Line_TierColor_Line;     // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UM1UIData*                              CallFunc_GetUIData_ReturnValue;                    // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UM1UIDataItemInfo*                      K2Node_DynamicCast_AsM1UIData_Item_Info_1;         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InbDragDetected;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_EnchantLevel;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_EnchantMaxLevel;                      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_TargetLevel;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UM1UIData*                              CallFunc_GetUIData_ReturnValue_1;                  // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UM1UIDataItemInfo*                      K2Node_DynamicCast_AsM1UIData_Item_Info_2;         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EM1ElementalDamageChannel                     K2Node_Event_InElementalDamageChannel;             // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EM1SkillArcheType                             K2Node_Event_InSkillArcheType;                     // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Get_UI_ArcheType_Icon_ArcheTypeIcon;      // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Get_UI_ElemntalType_Icon_ElementalTypeIcon; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x00A8(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1; // 0x00D8(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShow;                                // 0x0114(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon) == 0x000008, "Wrong alignment on UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon");
static_assert(sizeof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon) == 0x000118, "Wrong size on UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, EntryPoint) == 0x000000, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, Temp_byte_Variable) == 0x000004, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, Temp_byte_Variable_1) == 0x000005, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, Temp_byte_Variable_2) == 0x000006, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, Temp_byte_Variable_3) == 0x000007, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, Temp_byte_Variable_4) == 0x000008, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, Temp_byte_Variable_5) == 0x000009, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, Temp_byte_Variable_6) == 0x00000A, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, Temp_byte_Variable_7) == 0x00000B, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, Temp_byte_Variable_8) == 0x00000C, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, Temp_byte_Variable_9) == 0x00000D, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, Temp_byte_Variable_10) == 0x00000E, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, Temp_byte_Variable_11) == 0x00000F, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, Temp_byte_Variable_12) == 0x000010, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, Temp_byte_Variable_13) == 0x000011, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, Temp_byte_Variable_14) == 0x000012, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, Temp_byte_Variable_15) == 0x000013, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::Temp_byte_Variable_15' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, K2Node_Event_InData) == 0x000018, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::K2Node_Event_InData' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, K2Node_Event_IsDesignTime) == 0x000020, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, K2Node_DynamicCast_AsM1UIData_Item_Info) == 0x000028, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::K2Node_DynamicCast_AsM1UIData_Item_Info' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, CallFunc_GetItemTier_ReturnValue) == 0x000031, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::CallFunc_GetItemTier_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, CallFunc_Get_UI_TierColor_Line_TierColor_Line) == 0x000034, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::CallFunc_Get_UI_TierColor_Line_TierColor_Line' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, Temp_int_Variable) == 0x000044, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, CallFunc_GetUIData_ReturnValue) == 0x000048, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::CallFunc_GetUIData_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, K2Node_DynamicCast_AsM1UIData_Item_Info_1) == 0x000050, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::K2Node_DynamicCast_AsM1UIData_Item_Info_1' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, K2Node_Event_InbDragDetected) == 0x000059, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::K2Node_Event_InbDragDetected' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, K2Node_Event_EnchantLevel) == 0x00005C, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::K2Node_Event_EnchantLevel' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, K2Node_Event_EnchantMaxLevel) == 0x000060, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::K2Node_Event_EnchantMaxLevel' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, K2Node_Event_TargetLevel) == 0x000064, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::K2Node_Event_TargetLevel' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000068, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, Temp_int_Variable_1) == 0x00006C, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, Temp_int_Variable_2) == 0x000070, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, CallFunc_GetUIData_ReturnValue_1) == 0x000078, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::CallFunc_GetUIData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, Temp_int_Variable_3) == 0x000080, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, K2Node_DynamicCast_AsM1UIData_Item_Info_2) == 0x000088, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::K2Node_DynamicCast_AsM1UIData_Item_Info_2' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, K2Node_Event_InElementalDamageChannel) == 0x000091, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::K2Node_Event_InElementalDamageChannel' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, K2Node_Event_InSkillArcheType) == 0x000092, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::K2Node_Event_InSkillArcheType' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, K2Node_Select_Default) == 0x000093, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, K2Node_Select_Default_1) == 0x000094, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, CallFunc_Get_UI_ArcheType_Icon_ArcheTypeIcon) == 0x000098, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::CallFunc_Get_UI_ArcheType_Icon_ArcheTypeIcon' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, CallFunc_Get_UI_ElemntalType_Icon_ElementalTypeIcon) == 0x0000A0, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::CallFunc_Get_UI_ElemntalType_Icon_ElementalTypeIcon' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x0000A8, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1) == 0x0000D8, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, Temp_int_Variable_4) == 0x000108, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, Temp_int_Variable_5) == 0x00010C, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, K2Node_Select_Default_2) == 0x000110, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon, K2Node_Event_bShow) == 0x000114, "Member 'UI_ItemIcon_C_ExecuteUbergraph_UI_ItemIcon::K2Node_Event_bShow' has a wrong offset!");

// Function UI_ItemIcon.UI_ItemIcon_C.BP_ShowSetOptionIcon
// 0x0001 (0x0001 - 0x0000)
struct UI_ItemIcon_C_BP_ShowSetOptionIcon final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ItemIcon_C_BP_ShowSetOptionIcon) == 0x000001, "Wrong alignment on UI_ItemIcon_C_BP_ShowSetOptionIcon");
static_assert(sizeof(UI_ItemIcon_C_BP_ShowSetOptionIcon) == 0x000001, "Wrong size on UI_ItemIcon_C_BP_ShowSetOptionIcon");
static_assert(offsetof(UI_ItemIcon_C_BP_ShowSetOptionIcon, bShow) == 0x000000, "Member 'UI_ItemIcon_C_BP_ShowSetOptionIcon::bShow' has a wrong offset!");

// Function UI_ItemIcon.UI_ItemIcon_C.BP_SetReactorEnchantLevel
// 0x000C (0x000C - 0x0000)
struct UI_ItemIcon_C_BP_SetReactorEnchantLevel final
{
public:
	int32                                         EnchantLevel;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EnchantMaxLevel;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Targetlevel;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ItemIcon_C_BP_SetReactorEnchantLevel) == 0x000004, "Wrong alignment on UI_ItemIcon_C_BP_SetReactorEnchantLevel");
static_assert(sizeof(UI_ItemIcon_C_BP_SetReactorEnchantLevel) == 0x00000C, "Wrong size on UI_ItemIcon_C_BP_SetReactorEnchantLevel");
static_assert(offsetof(UI_ItemIcon_C_BP_SetReactorEnchantLevel, EnchantLevel) == 0x000000, "Member 'UI_ItemIcon_C_BP_SetReactorEnchantLevel::EnchantLevel' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_BP_SetReactorEnchantLevel, EnchantMaxLevel) == 0x000004, "Member 'UI_ItemIcon_C_BP_SetReactorEnchantLevel::EnchantMaxLevel' has a wrong offset!");
static_assert(offsetof(UI_ItemIcon_C_BP_SetReactorEnchantLevel, Targetlevel) == 0x000008, "Member 'UI_ItemIcon_C_BP_SetReactorEnchantLevel::Targetlevel' has a wrong offset!");

// Function UI_ItemIcon.UI_ItemIcon_C.BP_SetElementalType
// 0x0001 (0x0001 - 0x0000)
struct UI_ItemIcon_C_BP_SetElementalType final
{
public:
	EM1ElementalDamageChannel                     InElementalDamageChannel;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ItemIcon_C_BP_SetElementalType) == 0x000001, "Wrong alignment on UI_ItemIcon_C_BP_SetElementalType");
static_assert(sizeof(UI_ItemIcon_C_BP_SetElementalType) == 0x000001, "Wrong size on UI_ItemIcon_C_BP_SetElementalType");
static_assert(offsetof(UI_ItemIcon_C_BP_SetElementalType, InElementalDamageChannel) == 0x000000, "Member 'UI_ItemIcon_C_BP_SetElementalType::InElementalDamageChannel' has a wrong offset!");

// Function UI_ItemIcon.UI_ItemIcon_C.BP_SetArcheType
// 0x0001 (0x0001 - 0x0000)
struct UI_ItemIcon_C_BP_SetArcheType final
{
public:
	EM1SkillArcheType                             InSkillArcheType;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ItemIcon_C_BP_SetArcheType) == 0x000001, "Wrong alignment on UI_ItemIcon_C_BP_SetArcheType");
static_assert(sizeof(UI_ItemIcon_C_BP_SetArcheType) == 0x000001, "Wrong size on UI_ItemIcon_C_BP_SetArcheType");
static_assert(offsetof(UI_ItemIcon_C_BP_SetArcheType, InSkillArcheType) == 0x000000, "Member 'UI_ItemIcon_C_BP_SetArcheType::InSkillArcheType' has a wrong offset!");

// Function UI_ItemIcon.UI_ItemIcon_C.BP_OnDragDetected
// 0x0001 (0x0001 - 0x0000)
struct UI_ItemIcon_C_BP_OnDragDetected final
{
public:
	bool                                          InbDragDetected;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ItemIcon_C_BP_OnDragDetected) == 0x000001, "Wrong alignment on UI_ItemIcon_C_BP_OnDragDetected");
static_assert(sizeof(UI_ItemIcon_C_BP_OnDragDetected) == 0x000001, "Wrong size on UI_ItemIcon_C_BP_OnDragDetected");
static_assert(offsetof(UI_ItemIcon_C_BP_OnDragDetected, InbDragDetected) == 0x000000, "Member 'UI_ItemIcon_C_BP_OnDragDetected::InbDragDetected' has a wrong offset!");

}

