#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Mission_Task_Invasion_HUDCenter

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UI_Mission_Task_Invasion_HUDCenter.UI_Mission_Task_Invasion_HUDCenter_C.SetDataImpl
// 0x0008 (0x0008 - 0x0000)
struct UI_Mission_Task_Invasion_HUDCenter_C_SetDataImpl final
{
public:
	class UM1UIData*                              InData;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Mission_Task_Invasion_HUDCenter_C_SetDataImpl) == 0x000008, "Wrong alignment on UI_Mission_Task_Invasion_HUDCenter_C_SetDataImpl");
static_assert(sizeof(UI_Mission_Task_Invasion_HUDCenter_C_SetDataImpl) == 0x000008, "Wrong size on UI_Mission_Task_Invasion_HUDCenter_C_SetDataImpl");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_SetDataImpl, InData) == 0x000000, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_SetDataImpl::InData' has a wrong offset!");

// Function UI_Mission_Task_Invasion_HUDCenter.UI_Mission_Task_Invasion_HUDCenter_C.Set Sub Type
// 0x0048 (0x0048 - 0x0000)
struct UI_Mission_Task_Invasion_HUDCenter_C_Set_Sub_Type final
{
public:
	uint8                                         InSubType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_2;                            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default;                             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Mission_Task_Invasion_HUDCenter_C_Set_Sub_Type) == 0x000008, "Wrong alignment on UI_Mission_Task_Invasion_HUDCenter_C_Set_Sub_Type");
static_assert(sizeof(UI_Mission_Task_Invasion_HUDCenter_C_Set_Sub_Type) == 0x000048, "Wrong size on UI_Mission_Task_Invasion_HUDCenter_C_Set_Sub_Type");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_Set_Sub_Type, InSubType) == 0x000000, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_Set_Sub_Type::InSubType' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_Set_Sub_Type, Temp_byte_Variable) == 0x000001, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_Set_Sub_Type::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_Set_Sub_Type, Temp_string_Variable) == 0x000008, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_Set_Sub_Type::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_Set_Sub_Type, Temp_string_Variable_1) == 0x000018, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_Set_Sub_Type::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_Set_Sub_Type, Temp_string_Variable_2) == 0x000028, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_Set_Sub_Type::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_Set_Sub_Type, K2Node_Select_Default) == 0x000038, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_Set_Sub_Type::K2Node_Select_Default' has a wrong offset!");

// Function UI_Mission_Task_Invasion_HUDCenter.UI_Mission_Task_Invasion_HUDCenter_C.ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter
// 0x0080 (0x0080 - 0x0000)
struct UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInShow;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInFullyCollected;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UM1UIData*                              K2Node_Event_InData;                               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UM1UIDataTaskCollectionReturnInfo*      K2Node_DynamicCast_AsM1UIData_Task_Collection_Return_Info; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCollectionCountTextByLocalPlayer_ReturnValue; // 0x0058(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayUIAnimation_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter) == 0x000008, "Wrong alignment on UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter");
static_assert(sizeof(UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter) == 0x000080, "Wrong size on UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter, EntryPoint) == 0x000000, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter, K2Node_Event_bInShow) == 0x000004, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter::K2Node_Event_bInShow' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter, CallFunc_GetEndTime_ReturnValue) == 0x000010, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter, K2Node_Event_bInFullyCollected) == 0x000020, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter::K2Node_Event_bInFullyCollected' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter, CallFunc_IsVisible_ReturnValue) == 0x000021, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter, CallFunc_IsVisible_ReturnValue_1) == 0x000022, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000023, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter, CallFunc_Not_PreBool_ReturnValue) == 0x000024, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter, CallFunc_BooleanAND_ReturnValue) == 0x000025, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000026, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter, K2Node_Event_InData) == 0x000040, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter::K2Node_Event_InData' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter, K2Node_DynamicCast_AsM1UIData_Task_Collection_Return_Info) == 0x000048, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter::K2Node_DynamicCast_AsM1UIData_Task_Collection_Return_Info' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter, CallFunc_GetCollectionCountTextByLocalPlayer_ReturnValue) == 0x000058, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter::CallFunc_GetCollectionCountTextByLocalPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter, CallFunc_PlayUIAnimation_ReturnValue) == 0x000070, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter::CallFunc_PlayUIAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000078, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_ExecuteUbergraph_UI_Mission_Task_Invasion_HUDCenter::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");

// Function UI_Mission_Task_Invasion_HUDCenter.UI_Mission_Task_Invasion_HUDCenter_C.BP_UpdateCollectionReturnState
// 0x0001 (0x0001 - 0x0000)
struct UI_Mission_Task_Invasion_HUDCenter_C_BP_UpdateCollectionReturnState final
{
public:
	bool                                          bInFullyCollected;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Mission_Task_Invasion_HUDCenter_C_BP_UpdateCollectionReturnState) == 0x000001, "Wrong alignment on UI_Mission_Task_Invasion_HUDCenter_C_BP_UpdateCollectionReturnState");
static_assert(sizeof(UI_Mission_Task_Invasion_HUDCenter_C_BP_UpdateCollectionReturnState) == 0x000001, "Wrong size on UI_Mission_Task_Invasion_HUDCenter_C_BP_UpdateCollectionReturnState");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_BP_UpdateCollectionReturnState, bInFullyCollected) == 0x000000, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_BP_UpdateCollectionReturnState::bInFullyCollected' has a wrong offset!");

// Function UI_Mission_Task_Invasion_HUDCenter.UI_Mission_Task_Invasion_HUDCenter_C.BP_ShowWidget
// 0x0001 (0x0001 - 0x0000)
struct UI_Mission_Task_Invasion_HUDCenter_C_BP_ShowWidget final
{
public:
	bool                                          bInShow;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Mission_Task_Invasion_HUDCenter_C_BP_ShowWidget) == 0x000001, "Wrong alignment on UI_Mission_Task_Invasion_HUDCenter_C_BP_ShowWidget");
static_assert(sizeof(UI_Mission_Task_Invasion_HUDCenter_C_BP_ShowWidget) == 0x000001, "Wrong size on UI_Mission_Task_Invasion_HUDCenter_C_BP_ShowWidget");
static_assert(offsetof(UI_Mission_Task_Invasion_HUDCenter_C_BP_ShowWidget, bInShow) == 0x000000, "Member 'UI_Mission_Task_Invasion_HUDCenter_C_BP_ShowWidget::bInShow' has a wrong offset!");

}

