#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Valby

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"


namespace SDK::Params
{

// Function Valby.Valby_C.IsStepOnWetForLocal
// 0x0006 (0x0006 - 0x0000)
struct Valby_C_IsStepOnWetForLocal final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActiveTag_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              CallFunc_GetSteppingOnPhysicalSurface_ReturnValue; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valby_C_IsStepOnWetForLocal) == 0x000001, "Wrong alignment on Valby_C_IsStepOnWetForLocal");
static_assert(sizeof(Valby_C_IsStepOnWetForLocal) == 0x000006, "Wrong size on Valby_C_IsStepOnWetForLocal");
static_assert(offsetof(Valby_C_IsStepOnWetForLocal, ReturnValue) == 0x000000, "Member 'Valby_C_IsStepOnWetForLocal::ReturnValue' has a wrong offset!");
static_assert(offsetof(Valby_C_IsStepOnWetForLocal, CallFunc_IsLocallyControlled_ReturnValue) == 0x000001, "Member 'Valby_C_IsStepOnWetForLocal::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valby_C_IsStepOnWetForLocal, CallFunc_IsActiveTag_ReturnValue) == 0x000002, "Member 'Valby_C_IsStepOnWetForLocal::CallFunc_IsActiveTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valby_C_IsStepOnWetForLocal, CallFunc_GetSteppingOnPhysicalSurface_ReturnValue) == 0x000003, "Member 'Valby_C_IsStepOnWetForLocal::CallFunc_GetSteppingOnPhysicalSurface_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valby_C_IsStepOnWetForLocal, CallFunc_Array_Contains_ReturnValue) == 0x000004, "Member 'Valby_C_IsStepOnWetForLocal::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valby_C_IsStepOnWetForLocal, CallFunc_BooleanOR_ReturnValue) == 0x000005, "Member 'Valby_C_IsStepOnWetForLocal::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

